"use strict";

window.Names = (function () {
  let chains = [];

  // calculate Markov chain for a namesbase
  const calculateChain = function (string) {
    const chain = [];
    const array = string.split(",");

    for (const n of array) {
      let name = n.trim().toLowerCase();
      const basic = !/[^\u0000-\u007f]/.test(name); // basic chars and English rules can be applied

      // split word into pseudo-syllables
      for (
        let i = -1, syllable = "";
        i < name.length;
        i += syllable.length || 1, syllable = ""
      ) {
        let prev = name[i] || ""; // pre-onset letter
        let v = 0; // 0 if no vowels in syllable

        for (let c = i + 1; name[c] && syllable.length < 5; c++) {
          const that = name[c],
            next = name[c + 1]; // next char
          syllable += that;
          if (syllable === " " || syllable === "-") break; // syllable starts with space or hyphen
          if (!next || next === " " || next === "-") break; // no need to check

          if (vowel(that)) v = 1; // check if letter is vowel

          // do not split some diphthongs
          if (that === "y" && next === "e") continue; // 'ye'
          if (basic) {
            // English-like
            if (that === "o" && next === "o") continue; // 'oo'
            if (that === "e" && next === "e") continue; // 'ee'
            if (that === "a" && next === "e") continue; // 'ae'
            if (that === "c" && next === "h") continue; // 'ch'
          }

          if (vowel(that) === next) break; // two same vowels in a row
          if (v && vowel(name[c + 2])) break; // syllable has vowel and additional vowel is expected soon
        }

        if (chain[prev] === undefined) chain[prev] = [];
        chain[prev].push(syllable);
      }
    }

    return chain;
  };

  const updateChain = (i) => {
    chains[i] = nameBases[i]?.b ? calculateChain(nameBases[i].b) : null;
  };

  const clearChains = () => {
    chains = [];
  };

  // generate name using Markov's chain
  const getBase = function (base, min, max, dupl) {
    if (base === undefined) return ERROR && console.error("请定义一个名称库");

    if (nameBases[base] === undefined) {
      if (nameBases[0]) {
        WARN &&
          console.warn("未找到名称库 " + base + "。将使用第一个可用的名称库");
        base = 0;
      } else {
        ERROR && console.error("未找到名称库 " + base);
        return "错误";
      }
    }

    if (!chains[base]) updateChain(base);

    const data = chains[base];

    let name = "";

    if (hasChinese(data[""][0])) {
      name = ra(data[""]);
    } else {
      if (!data || data[""] === undefined) {
        tip(
          "名称库 " + base + " 不正确。请在名称库编辑器中检查",
          false,
          "error"
        );
        ERROR && console.error("名称库 " + base + " 不正确！");
        return "错误";
      }

      if (!min) min = nameBases[base].min;
      if (!max) max = nameBases[base].max;
      if (dupl !== "") dupl = nameBases[base].d;

      let v = data[""],
        cur = ra(v),
        w = "";

      for (let i = 0; i < 20; i++) {
        if (cur === "") {
          // end of word
          if (w.length < min) {
            cur = "";
            w = "";
            v = data[""];
          } else {
            break;
          }
        } else {
          if (w.length + cur.length > max) {
            // word too long
            if (w.length < min) w += cur;
            break;
          } else v = data[last(cur)] || data[""];
        }

        w += cur;
        cur = ra(v);
      }

      // parse word to get a final name
      const l = last(w); // last letter
      if (l === "'" || l === " " || l === "-") w = w.slice(0, -1); // not allow some characters at the end

      name = [...w].reduce(function (r, c, i, d) {
        if (c === d[i + 1] && !dupl.includes(c)) return r; // duplication is not allowed
        if (!r.length) return c.toUpperCase();
        if (r.slice(-1) === "-" && c === " ") return r; // remove space after hyphen
        if (r.slice(-1) === " ") return r + c.toUpperCase(); // capitalize letter after space
        if (r.slice(-1) === "-") return r + c.toUpperCase(); // capitalize letter after hyphen
        if (c === "a" && d[i + 1] === "e") return r; // "ae" => "e"
        if (i + 2 < d.length && c === d[i + 1] && c === d[i + 2]) return r; // remove three same letters in a row
        return r + c;
      }, "");

      // join the word if any part has only 1 letter
      if (name.split(" ").some((part) => part.length < 2))
        name = name
          .split(" ")
          .map((p, i) => (i ? p.toLowerCase() : p))
          .join("");

      if (name.length < 1) {
        ERROR && console.error(`名称“${name}”太短！将选择随机名称`);
        name = ra(nameBases[base].b.split(","));
      }
    }
    return name;
  };

  // generate name for culture
  const getCulture = function (culture, min, max, dupl) {
    if (culture === undefined) return ERROR && console.error("请定义一个文化");
    const base = pack.cultures[culture].base;
    return getBase(base, min, max, dupl);
  };

  // generate short name for culture
  const getCultureShort = function (culture) {
    if (culture === undefined) return ERROR && console.error("请定义一个文化");
    return getBaseShort(pack.cultures[culture].base);
  };

  // generate short name for base
  const getBaseShort = function (base) {
    const min = nameBases[base] ? nameBases[base].min - 1 : null;
    const max = min ? Math.max(nameBases[base].max - 2, min) : null;
    return getBase(base, min, max, "", 0);
  };

  // generate state name based on capital or random name and culture-specific suffix
  const getState = function (name, culture, base) {
    if (name === undefined) return ERROR && console.error("请定义名称库名称");
    if (culture === undefined && base === undefined)
      return ERROR && console.error("请定义一个文化");
    if (base === undefined) base = pack.cultures[culture].base;

    let suffix = "";

    // exclude endings inappropriate for states name
    if (!hasChinese(name)) {
      if (name.includes(" "))
        name = capitalize(name.replace(/ /g, "").toLowerCase()); // don't allow multiword state names
      if (name.length > 6 && name.slice(-4) === "berg")
        name = name.slice(0, -4); // remove -berg for any
      if (name.length > 5 && name.slice(-3) === "ton") name = name.slice(0, -3); // remove -ton for any

      if (base === 5 && ["sk", "ev", "ov"].includes(name.slice(-2)))
        name = name.slice(0, -2);
      // remove -sk/-ev/-ov for Ruthenian
      else if (base === 12) return vowel(name.slice(-1)) ? name : name + "u";
      // Japanese ends on any vowel or -u
      else if (base === 18 && P(0.4))
        name = vowel(name.slice(0, 1).toLowerCase())
          ? "Al" + name.toLowerCase()
          : "Al " + name; // Arabic starts with -Al

      // no suffix for fantasy bases
      if (base > 32 && base < 42) return name;

      // define if suffix should be used
      if (name.length > 3 && vowel(name.slice(-1))) {
        if (vowel(name.slice(-2, -1)) && P(0.85)) name = name.slice(0, -2);
        // 85% for vv
        else if (P(0.7)) name = name.slice(0, -1);
        // ~60% for cv
        else return name;
      } else if (P(0.4)) return name; // 60% for cc and vc
      suffix = "ia";
      const rnd = Math.random(),
        l = name.length;
      if (base === 3 && rnd < 0.03 && l < 7) suffix = "terra";
      // Italian
      else if (base === 4 && rnd < 0.03 && l < 7) suffix = "terra";
      // Spanish
      else if (base === 13 && rnd < 0.03 && l < 7) suffix = "terra";
      // Portuguese
      else if (base === 2 && rnd < 0.03 && l < 7) suffix = "terre";
      // French
      else if (base === 0 && rnd < 0.5 && l < 7) suffix = "land";
      // German
      else if (base === 1 && rnd < 0.4 && l < 7) suffix = "land";
      // English
      else if (base === 6 && rnd < 0.3 && l < 7) suffix = "land";
      // Nordic
      else if (base === 32 && rnd < 0.1 && l < 7) suffix = "land";
      // generic Human
      else if (base === 7 && rnd < 0.1) suffix = "eia";
      // Greek
      else if (base === 9 && rnd < 0.35) suffix = "maa";
      // Finnic
      else if (base === 15 && rnd < 0.4 && l < 6) suffix = "orszag";
      // Hungarian
      else if (base === 16) suffix = rnd < 0.6 ? "yurt" : "eli";
      // Turkish
      else if (base === 10) suffix = "guk";
      // Korean
      else if (base === 11) suffix = " Guo";
      // Chinese
      else if (base === 14) suffix = rnd < 0.5 && l < 6 ? "tlan" : "co";
      // Nahuatl
      else if (base === 17 && rnd < 0.8) suffix = "a";
      // Berber
      else if (base === 18 && rnd < 0.8) suffix = "a"; // Arabic
    }
    return validateSuffix(name, suffix);
  };

  function validateSuffix(name, suffix) {
    if (name.slice(-1 * suffix.length) === suffix) return name; // no suffix if name already ends with it
    const s1 = suffix.charAt(0);
    if (name.slice(-1) === s1) name = name.slice(0, -1); // remove name last letter if it's a suffix first letter
    if (
      vowel(s1) === vowel(name.slice(-1)) &&
      vowel(s1) === vowel(name.slice(-2, -1))
    )
      name = name.slice(0, -1); // remove name last char if 2 last chars are the same type as suffix's 1st
    if (name.slice(-1) === s1) name = name.slice(0, -1); // remove name last letter if it's a suffix first letter
    return name + suffix;
  }

  // generato name for the map
  const getMapName = function (force) {
    if (!force && locked("mapName")) return;
    if (force && locked("mapName")) unlock("mapName");
    const base = P(0.7) ? 2 : P(0.5) ? rand(0, 6) : rand(0, 31);
    if (!nameBases[base]) {
      tip("未找到名称库", false, "error");
      return "";
    }
    const min = nameBases[base].min - 1;
    const max = Math.max(nameBases[base].max - 3, min);
    const baseName = getBase(base, min, max, "", 0);
    const name = P(0.7) ? addSuffix(baseName) : baseName;
    mapName.value = name;
  };

  function addSuffix(name) {
    if (hasChinese(name)) return name;
    const suffix = P(0.8) ? "ia" : "land";
    if (suffix === "ia" && name.length > 6)
      name = name.slice(0, -(name.length - 3));
    else if (suffix === "land" && name.length > 6)
      name = name.slice(0, -(name.length - 5));
    return validateSuffix(name, suffix);
  }

  const getNameBases = function () {
    return [
      {
        name: "德语",
        i: 0,
        min: 1,
        min: 10,
        d: "lt",
        m: 0,
        b: "阿亨,艾希哈尔登,艾滕,阿尔布吕克,阿尔皮尔斯巴赫,阿尔滕施泰格,阿尔滕施泰特,阿彭魏尔,奥根,巴登,巴登韦勒,拜尔斯布龙,巴尔雷希滕,贝林根,贝格豪普滕,贝尔瑙,比伯拉赫,比德巴赫,宾岑,比尔肯多夫,比尔肯费尔德,比施魏尔,布隆贝格,博伦,博尔施魏尔,邦多夫,博辛根,布劳因林根,布莱萨赫,布莱斯高,布赖特瑙,布里加赫塔尔,布亨巴赫,布京根,布尔,布尔塔尔,卡尔夫,达克斯贝格,多贝尔,多瑙埃兴根,多恩汉,多恩施泰滕,多廷根,邓宁根,杜尔巴赫,杜尔海姆,埃布豪森,埃布林根,埃夫林根,埃根豪森,埃伦基兴,埃尔斯贝格,艾梅尔丁根,艾森巴赫,埃尔扎克,埃尔茨塔尔,埃门丁根,恩丁根,恩格斯布兰德,恩茨,恩茨克洛斯特勒,埃施布龙,埃滕海姆,埃特林根,费尔德贝格,菲舍尔巴赫,菲兴根,弗卢恩,福尔巴赫,弗赖阿姆特,弗赖堡,弗罗伊登施塔特,弗里登韦勒,弗赖森海姆,弗龙德,富特旺根,加格瑙,盖辛根,根根巴赫,盖恩斯巴赫,格拉特,格拉滕,格洛特塔尔,戈尔维勒,戈滕海姆,格拉芬豪森,格伦察赫,格里斯巴赫,古塔赫,古滕巴赫,哈格,海特巴赫,哈尔特,哈默斯巴赫,哈塞尔,哈斯拉赫,豪萨赫,豪森,豪森,海特斯海姆,赫尔博尔茨海姆,赫伦阿尔布,赫里斯克里德,欣特察尔滕,霍亨施万德,霍芬,霍夫施泰滕,霍赫贝格,霍尔布,霍尔本,霍恩贝格,胡芬根,伊巴赫,伊林根,因茨林根,坎德恩,卡佩尔,卡佩尔罗德克,卡尔斯巴德,卡尔斯鲁厄,凯尔,凯尔特恩,基彭海姆,基希察尔滕,柯尼希斯费尔德,克罗青根,库彭海姆,库萨贝格,拉尔,劳赫林根,劳夫,劳芬堡,劳滕巴赫,劳特巴赫,伦茨基希,利本采尔,洛费瑙,洛芬根,罗拉赫,洛斯堡,马尔贝格,马斯堡,马尔施,马尔希,马克斯采尔,马尔采尔,毛尔堡,蒙希魏勒,米伦巴赫,米尔海姆,明斯特塔尔,穆尔格,纳戈尔德,新布拉赫,诺伊堡,诺伊豪森,诺伊里德,诺伊韦勒,下埃沙赫,诺德拉赫,上哈默斯巴赫,上基希,上多夫,上巴赫,上里德,上沃尔法赫,奥芬堡,奥尔斯巴赫,奥彭瑙,奥滕贝格,奥蒂盖姆,奥滕霍芬,奥特斯韦勒,彼得斯塔尔,普法芬韦勒,普法尔茨格拉芬韦勒,普福尔茨海姆,拉斯塔特,伦兴,莱茵瑙,莱茵费尔登,莱茵明斯特,里肯巴赫,里波尔德绍,罗尔多夫,罗特韦尔,鲁明根,鲁斯特,萨克ingen,萨斯巴赫,萨斯巴赫瓦尔德,沙尔巴赫,沙尔施塔特,沙普巴赫,申肯采尔,希尔塔赫,施林根,施卢赫湖,舍姆贝格,绍纳赫,绍瑙,绍嫩贝格,绍恩瓦尔德,肖普夫海姆,肖普夫洛赫,施兰贝格,舒特尔塔尔,施文宁根,施沃施塔特,塞巴赫,塞尔巴赫,塞瓦尔德,塞克绍,西默斯费尔德,西蒙斯瓦尔德,辛茨海姆,索尔登,施陶芬,施泰根,施泰因巴赫,施泰嫩,施泰因毛恩,施特劳本哈尔特,施蒂林根,苏尔茨,苏尔茨堡,泰因阿赫,蒂芬布龙,廷根,蒂蒂湖,托特莫斯,托特瑙,托特瑙贝格,特里贝格,图瑙,图宁根,乌赫林根,下基尔纳赫,乌岑费尔德,菲林根,菲林根多夫,福格茨堡,福伦巴赫,瓦尔达赫塔尔,瓦尔德布龙,瓦尔德基希,瓦尔茨胡特,韦尔,魏尔,魏尔海姆,魏森巴赫,文巴赫,维登,维森塔尔,维尔德巴德,维尔德贝格,温策尔恩,维特林根,维特瑙,沃尔法赫,武塔赫,武托兴根,维伦",
      },
      {
        name: "英语",
        i: 1,
        min: 1,
        min: 10,
        d: "",
        m: 0.1,
        b: "阿宾登,奥尔布赖顿,阿尔斯特,奥蒙德伯里,奥特林厄姆,阿默舍姆,安多弗,阿普比,阿什本,阿瑟斯通,埃夫顿,阿克斯布里奇,艾尔斯伯里,鲍多克,班堡,巴顿,贝辛斯托克,伯登,贝尔,伯克利,贝里克,贝特利,比迪福德,宾利,伯明翰,布兰福德,布莱钦利,博德明,博尔顿,布瑟姆,伯勒布里奇,博斯卡斯特尔,博西尼,布兰伯,布兰普顿,布拉斯特德,布雷特福德,布里奇敦,布里德灵顿,布罗米尔德,布鲁顿,白金汉,邦盖,伯顿,卡恩,剑桥,坎特伯雷,卡莱尔,卡斯尔顿,考斯,查茅斯,乔利,奇切斯特,奇林顿,钦诺,奇平,奇斯伯里,克利伯里,克利福德,克利夫顿,克利瑟罗,科克茅斯,科勒希尔,库姆,康格尔顿,克拉夫霍尔,克雷迪顿,卡登贝克,多尔顿,达灵顿,多德布鲁克,德雷克斯,达德利,邓斯特布尔,邓斯特,邓威奇,达勒姆,迪莫克,埃克塞特,埃克斯宁,法林登,费尔顿,芬尼,法因登,弗卢克堡,福伊,弗兰普顿,盖茨黑德,加顿,戈德曼彻斯特,格兰庞德,格兰瑟姆,吉尔福德,黑尔斯欧文,霍尔顿,哈博特尔,哈洛,哈特菲尔德,哈瑟利,海登,赫尔斯特恩,亨利,赫特福德,海特斯伯里,欣克利,希钦,霍尔姆,霍恩比,霍舍姆,肯德尔,凯尼尔沃思,基尔汉普顿,基内顿,金顿,金弗,柯比,克纳斯伯勒,克努特斯福德,朗塞斯顿,莱顿,刘易斯,林顿,劳斯,卢顿,莱姆,林普斯通,麦克尔斯菲尔德,梅德利,马尔伯勒,莫尔登,曼彻斯特,曼宁特里,马拉宰恩,马尔伯勒,马什菲尔德,米尔,梅里菲尔德,米德尔威奇,米德赫斯特,米尔本,米特福德,莫德伯里,蒙塔丘特,茅斯霍尔,纽比金,纽伯勒,纽伯里,纽恩登,纽恩特,诺勒姆,诺斯利奇,诺斯,奥克姆,奥尔尼,奥福德,奥姆斯柯克,奥斯威斯特里,帕德斯托,佩恩顿,彭克内斯,彭里斯,彭赞斯,珀肖尔,彼得斯菲尔德,佩文西,皮克林,皮尔顿,庞特弗拉克特,朴茨茅斯,普雷斯顿,夸特福德,雷丁,雷德克利夫,雷特福德,罗金厄姆,罗姆尼,罗斯伯里,罗斯韦尔,索尔兹伯里,萨尔塔什,锡福德,锡塞尔特,谢斯顿,希夫纳尔,肖勒姆,西德茅斯,斯基普西,斯基普顿,索利哈尔,萨默顿,绍瑟姆,萨瑟克,斯坦登,斯坦斯特德,斯特普尔顿,斯托特斯登,萨德伯里,斯韦夫西,塔默顿,塔波雷利,特伯里,撒彻姆,萨克斯泰德,塞特福德,桑伯里,廷塔杰尔,蒂弗顿,托克斯西,托特尼斯,托斯特,特里戈尼,特里马顿,塔特伯里,乌克斯布里奇,沃灵福德,韦勒姆,沃伦茅斯,沃格雷夫,沃顿,沃切特,沃特福德,温多弗,韦斯特伯里,韦斯特切普,韦茅斯,惠特福德,威克沃,维冈,威格莫尔,温切尔西,温克利,威斯科姆,威瑟姆,威瑟里奇,威弗利斯科姆,伍德伯里,约维尔",
      },
      {
        name: "法语",
        i: 2,
        min: 1,
        min: 10,
        d: "nlrs",
        m: 0.1,
        b: "阿东,艾朗,阿米伊,昂东维尔,阿尔东,阿尔特奈,阿舍雷,阿斯库,阿特雷,奥班,奥德维尔,奥奈,奥特吕,奥维利耶,奥克西,阿韦龙,巴孔,巴东,巴维尔,巴蒂伊,博勒,巴佐什,博尚,博让西,博略,博讷,贝尔加德,博埃斯,布瓦尼,布瓦孔,布瓦莫朗,布瓦索,邦达鲁瓦,博内,博尼,博尔德,布,布日,布伊,布莱,布宗维尔,布齐,布瓦讷,布雷,布莱萨赫,布莱斯,布赖特瑙,布里亚尔,布里亚尔,布里西,布罗梅耶,比西,塞普瓦,塞尔科特,塞尔东,塞尔努瓦,塞萨尔维尔,沙伊,尚日,沙莱特,尚邦,尚普莱,尚托,尚特科克,沙佩勒,沙尔姆,沙尔蒙,沙尔松维尔,沙托,沙托讷夫,沙泰勒,沙特努瓦,沙蒂永,绍西,舍西,舍瓦讷,舍维永,舍维利,舍夫里,希勒,舒,许埃勒,克莱里,夸安斯,科利尼,孔布勒,孔布勒,孔夫兰,科尔贝,科尔基罗瓦,科尔特拉,库德鲁瓦,库隆,库尔米埃,库塞尔,库西,库尔特莫,库尔特皮埃尔,库尔泰奈,克拉旺,克罗特,达东维尔,达马里,当皮埃尔,达鲁瓦,德蒙,迪芒什维尔,多内里,多尔迪沃,多桑维尔,杜希,德里,埃希勒,埃格里,昂让维尔,埃皮耶,埃尔瑟维尔,埃尔沃维尔,埃斯克伦,埃斯克里涅勒,埃斯图伊,法沃雷勒,费,费安,费罗勒,费里埃,弗勒里,丰特奈,福雷,富舍罗勒,弗雷维尔,加蒂奈,戈贝尔坦,热米尼,热尔米尼,吉迪,日安,吉罗勒,吉夫兰,贡德雷维尔,格朗蒙,格勒维尔,格里塞勒,吉涅维尔,吉利,吉勒洛奈,于埃特尔,于索,安格拉讷,安格尔,安特维尔,伊斯德,伊夫尔,雅尔若,茹伊,朱朗维尔,比西埃,拉斯,拉东,莱伊,朗热斯,勒乌维尔,利尼,隆布勒伊,洛尔西,洛里斯,卢里,卢祖埃,马勒谢布瓦,马西伊,马尔迪,马罗,马里尼,马尔桑维利耶,梅勒鲁瓦,梅内斯特罗,梅兰维尔,梅萨斯,默恩,梅济耶尔,米涅尔,米涅雷特,米拉波,蒙塔日,蒙巴鲁瓦,蒙布瓦,蒙克雷松,蒙雷阿尔,蒙蒂尼,蒙利亚尔,莫尔芒,莫尔维尔,穆利内,穆隆,南克雷,纳尔日,内斯普卢瓦,讷维尔,讷维,内瓦,尼贝勒,诺让,努瓦耶,奥克雷,瓦松,奥利韦,翁德勒维尔,翁泽兰,奥尔良,奥尔梅,奥尔维尔,乌苏瓦,乌塔尔维尔,乌祖埃,帕内西埃,帕讷,帕泰,波库尔,佩尔,皮埃尔菲特,皮蒂维耶,普瓦西,波蒂埃,普雷丰坦,普雷努瓦,普雷西尼,皮索,基耶,拉穆吕,雷布雷尚,鲁夫雷,罗齐耶,鲁瓦,鲁昂,桑迪永,桑托,萨兰,索,塞谢布里埃,瑟穆瓦,塞内利,塞尔迈斯,西格卢瓦,索尔泰尔,苏日,叙利,叙里,塔韦尔,蒂尼翁维尔,蒂莫里,托拉耶,图,蒂吉,蒂韦尔农,图尔努瓦西,特雷努,特雷耶,特里盖尔,特里奈,瓦讷,瓦雷讷,韦讷西,维耶伊,维埃纳,维兰,维涅,维兰布朗,维勒芒德尔,维勒穆兰,维勒讷沃,维勒罗,维勒沃克,维洛尔索,维莫里,维特里,夫里尼",
      },
      {
        name: "意大利语",
        i: 3,
        min: 1,
        min: 10,
        d: "cltr",
        m: 0.1,
        b: "阿库莫利,阿夸丰达塔,阿夸彭登泰,阿库托,阿菲利,阿戈斯塔,阿拉特里,阿尔巴诺,阿卢米耶雷,阿尔维托,阿马塞诺,阿马特里切,阿纳尼,安圭拉拉,安蒂科利,安特罗多科,安齐奥,阿普里利亚,阿奎诺,阿尔奇纳佐,阿里恰,阿尔皮诺,阿尔索利,奥索尼亚,巴尼奥雷焦,巴西亚诺,贝尔格拉,贝尔蒙特,博尔塞纳,博尔马佐,博尔戈罗塞,博维莱,布拉恰诺,布罗科斯特拉,卡尔卡塔,卡梅拉塔,坎帕尼亚诺,坎波利,卡纳莱,卡尼诺,坎塔利切,坎塔卢波,卡普拉尼卡,卡普拉罗拉,卡尔博尼亚诺,卡萨拉蒂科,卡萨利维耶里,卡斯泰尔福特,卡斯泰尔诺沃,卡斯蒂廖内,卡斯特罗,卡斯托齐耶洛,切卡诺,切莱诺,切莱雷,切雷托,切尔瓦拉,切尔韦泰里,钱皮诺,奇奇利亚诺,奇塔杜卡莱,奇塔雷亚莱,奇维塔,奇维泰拉,科尔费利切,科尔莱费罗,科尔莱帕多,科隆纳,孔切尔维亚诺,孔菲尼,孔蒂利亚诺,科里,科塔内洛,埃斯佩里亚,法莱里亚,法尔内塞,费伦蒂诺,菲亚米尼亚诺,菲拉恰诺,菲乌吉,菲乌米奇诺,丰迪,丰塔纳,丰泰,丰泰基亚里,福尔米亚,弗拉斯卡蒂,弗拉索,弗罗西诺内,富莫内,加埃塔,加莱塞,加维尼亚诺,杰纳扎诺,朱利亚诺,戈尔加,格拉多利,格罗塔费拉塔,格罗特,瓜尔奇诺,圭多尼亚,伊斯基亚,伊索拉,拉比科,拉布罗,拉迪斯波利,拉泰拉,莱诺拉,莱奥内萨,利琴扎,隆戈内,卢布里亚诺,马恩扎,马利亚诺,马拉诺,马切利纳,马尔切泰利,马里诺,马扎诺,门塔纳,米奇利亚诺,明图尔诺,蒙塔尔托,蒙塔索拉,蒙泰博诺,蒙泰弗拉维奥,蒙泰拉尼科,蒙特莱奥内,蒙特内罗,蒙特罗西,莫里科内,莫尔卢波,纳扎诺,内米,内罗拉,内斯波洛,内图诺,诺尔马,奥莱瓦诺,奥纳诺,奥廖洛,奥特,奥尔维尼奥,帕加尼科,帕利亚诺,帕隆巴拉,帕特里卡,佩斯科罗基阿诺,佩特雷拉,皮安萨诺,皮奇尼斯科,皮科,皮耶迪蒙特,皮利奥,皮尼亚塔罗,波焦,波利,波梅齐亚,蓬泰科尔沃,蓬蒂尼亚,蓬扎诺,波斯塔,波扎利亚,普里韦尔诺,普罗切诺,里尼亚诺,廖弗雷多,里皮,里沃杜特里,罗卡,罗卡戈尔加,罗坎蒂卡,罗卡塞卡,罗亚泰,龙奇廖内,罗维亚诺,萨利萨诺,桑布奇,圣塔,圣蒂尼,斯坎德里利亚,塞尼,塞尔奇,塞尔莫内塔,塞罗内,塞特夫拉蒂,塞泽,斯古尔戈拉,松尼诺,索拉,索里亚诺,斯佩隆加,斯皮尼奥,苏比亚科,苏皮诺,苏特里,塔拉诺,塔尔奎尼亚,特雷莱,泰拉奇纳,蒂沃利,托菲亚,托尔法,托里切,托里切拉,特雷维,特雷维尼亚诺,特里维利亚诺,图拉尼亚,图斯卡尼亚,瓦伦塔诺,瓦莱科尔萨,瓦莱马约,瓦莱皮耶特拉,瓦莱拉诺,瓦萨内洛,韦亚诺,韦莱特里,文托泰内,韦罗利,韦特拉拉,维卡尔维,维科,维科瓦罗,维尼亚内洛,维泰博,维蒂库索,维托里亚诺,维瓦罗,扎加罗洛",
      },
      {
        name: "西班牙语",
        i: 4,
        min: 1,
        min: 10,
        d: "lr",
        m: 0,
        b: "阿霍夫林,阿拉梅达,阿拉米诺斯,阿尔瓦雷斯,阿尔瓦雷亚尔,阿尔文迭戈,阿尔卡尼索,阿尔考德特,阿尔科莱亚,阿尔德亚,阿尔德亚努埃瓦,阿尔加尔,阿尔戈拉,阿尔翁迪加,阿尔马德罗斯,阿尔门德拉尔,阿洛维拉,安圭塔,阿尔万孔,阿尔赫西利亚,阿尔赫斯,阿罗约,阿坦松,阿蒂恩萨,阿苏凯卡,拜德斯,巴尼奥斯,巴尔加斯,巴里奥佩德罗,贝尔维斯,贝尔尼切斯,布里韦加,布埃纳文图拉,布尔戈斯,布尔吉略斯,布斯塔雷斯,卡瓦尼利亚斯,卡尔萨达,卡马雷纳,坎皮略,坎塔洛哈斯,卡迪埃尔,卡尔梅纳,卡萨斯,卡斯泰洪,卡斯蒂利亚尔,卡斯蒂尔福特,卡斯蒂略,卡斯蒂尔尼uevo,卡扎莱加斯,森特内拉,塞尔韦拉,切卡,乔萨斯,丘埃卡,西富恩特斯,辛科维利亚斯,西鲁埃拉斯,科戈略尔,科戈略多,孔苏埃格拉,科佩纳尔,科拉尔,奎尔瓦,多明戈,多斯巴rios,德里韦斯,杜龙,埃斯卡洛纳,埃斯卡洛尼利亚,埃斯卡米利亚,埃斯科佩特,埃斯皮诺萨,埃斯普莱加雷斯,埃斯基维亚斯,埃斯塔夫莱斯,埃斯特列加纳,丰塔纳,富恩贝利达,富恩萨利达,富恩特萨尔萨,加哈内霍斯,加尔韦斯,加斯奎纳,赫林多特,瓜达穆尔,埃拉斯,埃雷里亚,埃雷鲁埃拉,伊诺霍萨,希塔,翁布拉多斯,洪塔纳尔,奥尔米戈斯,韦卡斯,韦尔塔,乌马内斯,伊利亚纳,伊莱斯卡斯,伊涅斯托拉,伊鲁埃斯特,哈德拉凯,希鲁埃凯,拉加尔特拉,莱丹卡,利略,洛明查尔,洛兰卡,卢西略斯,卢萨加,卢松,马德里,马甘,马拉加,马尔皮卡,曼萨纳尔,马格达,马塞戈索,马蒂利亚斯,梅德兰达,梅希纳,梅霍拉达,米利亚纳,米尔马科斯,米拉布埃诺,米拉里奥,莫塞洪,莫查莱斯,莫利纳,蒙德哈尔,蒙塔龙,莫拉,莫拉蒂利亚,莫雷尼利亚,纳瓦斯,内格雷多,诺夫莱哈斯,努曼西亚,努诺,奥卡尼亚,奥森特霍,奥利阿斯,奥尔梅达,翁蒂戈拉,奥雷亚,奥尔加斯,奥罗佩萨,奥特罗,帕尔马,帕尔多斯,帕雷德斯,佩纳尔韦尔,佩皮诺,佩拉莱霍斯,皮尼利亚,皮奥兹,皮凯拉斯,波蒂略,波韦达,波索,普拉德纳,普拉多斯,普埃布拉,普埃尔托,克罗,金塔纳,雷沃略萨,雷塔莫索,里巴,里奥弗里奥,罗夫莱多,罗马尼略斯,罗马涅斯,鲁埃达,萨尔梅龙,桑蒂乌斯特,桑托,绍卡,塞古拉,塞拉斯,塞米利亚斯,塞塞纳,塞蒂莱斯,塞维利亚,锡古恩萨,索拉尼略斯,索莫利诺斯,松塞卡,索蒂略,塔拉韦拉,塔拉维拉,滕布莱克,滕迪利亚,铁尔佐,托拉尔巴,托雷,托雷洪,托里霍斯,托尔托拉,托尔图埃拉,托塔内斯,特里略,乌塞达,乌赫纳,乌尔达,乌坦德,巴尔德索托斯,巴列尔莫索,巴尔特布拉多,巴尔德韦德,贝拉达,比亚纳,耶夫拉,云科斯,云克拉,萨奥雷哈斯,萨尔苏埃拉,索里塔",
      },
      {
        name: "卢森尼亚语",
        i: 5,
        min: 1,
        max: 10,
        d: "",
        m: 0,
        b: "别尔哥罗德,别洛别列日耶,别伊,贝尔兹,别列斯季,别列热茨,别列佐韦茨,别列祖茨克,博布鲁伊斯克,博洛涅茨,鲍里索夫,博罗夫斯克,博热斯克,布拉茨拉夫,布良斯克,布梁斯克,布林,博霍夫,切切尔斯克,切梅索夫,切尔莫什,切尔连,切尔恩,切尔尼戈夫,切尔尼察,切尔诺贝利,切尔诺戈罗德,切尔托雷耶斯克,切特韦尔尼亚,杰缅斯克,杰列夫斯克,杰维亚戈雷斯克,季钦,德米特罗夫,多罗戈布日,多罗戈布日,德雷斯京,德罗科夫,德鲁茨克,杜比钦,杜比奇,杜布基,杜布科夫,德韦伦,加利奇,格列博沃,格林斯克,戈洛蒂,戈米伊,戈罗杰茨,戈罗季谢,戈罗德诺,戈罗霍韦茨,戈罗申,戈尔瓦尔,戈雷雄,霍尔姆,霍罗博尔,霍滕,霍京,霍特米日斯克,伊洛夫采,伊万,伊兹博尔斯克,伊热斯拉夫尔,卡梅涅茨,卡涅夫,卡拉切夫,卡尔纳,卡瓦尔纳,克列切斯克,克利亚佩奇,科洛米亚,科利万,科佩尔,科列茨,科尔尼克,科罗丘诺夫,科尔舍夫,科尔孙,科什金,科捷利诺,科维拉,科泽利斯克,科泽利斯克,克雷梅涅茨,克里切夫,克赖拉茨克,克斯尼亚京,库拉茨克,库尔斯克,库尔斯克,列别杰夫,利达,洛戈斯科,洛米赫沃斯特,洛舍斯克,洛希奇,柳别奇,卢布诺,卢布斯克,卢茨克,卢钦,卢基,卢科姆利,卢扎,利沃夫,姆岑斯克,姆丁,梅德尼基,梅列恰,梅雷奇,梅列茨克,梅晓尔斯科耶,梅什科夫斯克,梅特利茨克,梅泽茨克,姆格林,米哈伊洛夫,米基京,米库利诺,米洛斯拉维奇,莫吉廖夫,莫洛加,莫雷瓦,莫萨尔克斯,莫希尼,莫济里,姆斯季斯拉夫,姆斯季斯拉维茨,穆拉文,内梅奇,内米扎,涅林斯克,尼昌,诺夫哥罗德,新格罗德克,奥博利奇,奥博连斯克,奥博连斯克,奥列什克,奥尔戈夫,奥梅尔尼克,奥波卡,奥波基,奥列舍克,奥列茨,奥谢琴,奥斯特,奥斯特罗格,奥斯特罗夫,佩雷莱,佩雷米尔,佩列梅什利,佩列罗夫,佩列谢琴,佩列维茨克,佩列亚斯拉夫,平斯克,普莱斯,波洛茨克,普龙斯克,普罗波舍斯克,普尼亚,普季夫利,雷奇察,罗德诺,罗加乔夫,罗曼诺夫,罗姆内,罗斯拉夫尔,罗斯季斯拉夫尔,罗斯托韦茨,尔沙,鲁扎,雷布切斯克,雷利斯克,日扎韦斯克,勒热夫,日什乔夫,桑博尔,谢连斯克,谢连斯克,谢尔佩斯克,希洛夫,舒亚,西涅奇,西日卡,斯卡拉,斯洛文斯克,斯卢茨克,斯梅丁,斯涅波罗德,斯尼京,斯诺夫斯克,索切沃,索科莱茨,斯塔里察,斯塔罗杜布,斯捷潘,斯捷日,斯特雷欣,苏捷斯克,斯维内茨克,斯维斯洛奇,捷列博夫利,捷尔诺夫,捷希洛夫,捷捷林,季韦尔斯克,托尔切夫斯克,托罗佩茨,托尔若克,特里波列,特鲁布切夫斯克,图尔,图罗夫,乌斯维亚季,乌捷什科夫,瓦西尔科夫,韦利尔,韦利耶,韦涅夫,韦尼查,韦尔杰列夫,韦列亚,韦韦列斯克,维亚济马,维德别斯克,维迪切夫,沃伊诺,沃洛季梅尔,沃洛克,沃伦,沃罗别斯克,沃罗尼奇,沃罗诺克,沃罗滕斯克,夫列夫,夫鲁奇,夫谢卢格,维亚蒂奇斯克,维亚特卡,维什戈罗德,维什戈罗德,维索科耶,亚格尼亚京,雅罗波尔奇,亚谢涅茨,尤里耶夫,尤里耶韦茨,扎赖斯克,日托米尔,若尔瓦日,济热奇,祖布科夫,祖杰切夫,兹韦尼戈罗德",
      },
      {
        name: "挪威语",
        i: 6,
        min: 1,
        max: 10,
        d: "kln",
        m: 0.1,
        b: "阿库雷里,阿尔德拉,阿尔夫塔内斯,安讷内斯,奥斯特博,奥沃格,巴卡峡湾,巴朗根,巴达尔,贝斯峡湾,比弗罗斯特,比尔德达卢尔,比耶卡,比耶克维克,比约科森,布利克斯韦尔,布洛克肯,布隆杜奥斯,博尔加,博隆加维克,博格,博尔加内斯,博斯穆恩,博斯塔德,博斯特兰,博茨维卡,布劳塔尔霍尔特,布雷扎尔维克,布林斯利,布鲁纳利德,布达达尔,比格达克亚尔尼,达尔维克,尤皮沃古尔,多内斯,德拉盖伊德,德兰斯内斯,埃吉尔斯斯塔迪尔,艾特罗加,埃尔韦内斯,恩加沃根,埃尔滕沃格,埃斯基峡湾,埃文内斯,埃亚尔巴克基,法格内斯,法尔莫恩,费拉拜尔,费内斯,芬诺伊,菲亚尔,菲耶达尔,弗拉克斯塔德,弗拉泰里,弗洛斯特兰,弗卢迪尔,加尔达贝尔,加尔杜尔,吉姆斯塔德,吉瓦埃尔,耶罗伊,格拉德斯塔德,戈多伊,戈多伊内斯,格兰莫恩,格拉夫达尔,格雷尼维克,格里姆斯伊,格林达维克,格里廷,哈夫尼尔,哈尔萨,豪加内斯,豪格兰,豪克内斯,赫拉,赫兰,赫利桑杜尔,赫斯塔德,希格拉夫,赫尼夫斯达尔,霍芬,霍夫索斯,霍兰,霍拉尔,霍伦,霍尔克斯塔德,霍尔马维克,霍彭,霍夫登,赫拉纳吉尔,赫里塞伊,胡萨维克,胡斯维克,赫瓦姆斯坦吉,赫瓦内伊里,赫韦拉格尔迪,赫沃尔斯沃鲁尔,伊格罗伊,因德雷,因迪尔,英哈韦特,英内斯,伊萨峡湾,亚克拉乌斯特,亚恩斯雷基尔,容克达尔,卡尔兹沃格,坎斯塔德,卡尔索伊,卡沃森,凯夫拉维克,谢尔代,谢尔斯塔德,克拉克,科普阿斯克,科普拉沃古尔,科尔根,克里斯内斯,克鲁托加,克里斯塔德,克维纳,兰德,劳加尔,劳加拉斯,劳加尔巴克基,劳加尔瓦特恩,劳普斯塔德,莱内斯,莱拉,莱伦,利兰,伦维卡,洛丁,洛丁根,隆斯巴克基,洛普斯马克,洛温德,卢罗伊,梅拉,梅拉赫弗菲,梅洛伊,梅维克,米斯韦尔,莫内斯,莫斯费尔斯贝尔,莫斯肯斯,米肯,瑙尔斯塔德,内斯贝里,内斯贾赫弗菲,内塞特,内弗内斯,奥比格达,奥福特,奥格斯卡代特,奥克维卡,奥克内斯,奥拉夫峡湾,奥尔德维卡,奥尔斯塔德,翁斯塔德,奥佩伊德,奥雷斯维卡,奥尔斯内斯,奥尔斯沃格,奥斯迈拉,奥弗达尔,普雷托亚,劳达拉埃库尔,劳法罗夫恩,雷波,雷克霍拉尔,雷克霍尔特,雷克雅未克,里夫,里诺亚,罗多伊,罗格南,罗斯维卡,罗维卡,萨尔胡斯,桑登,桑格迪,桑多克,桑塞特,桑维卡,绍达尔克罗库尔,塞尔福斯,塞尔索亚,森内斯维克,塞特索,锡格卢峡湾,锡尔瓦伦,斯卡加斯特伦,谢尔斯塔德,斯科恩兰,斯科沃根,斯科罗娃,斯莱内塞特,斯努巴,索夫廷,索尔海姆,索尔海马尔,索拉诺伊,索尔富格洛伊,索兰,索梅拉,索尔韦尔,索维卡,斯塔姆松,斯塔姆斯维卡,斯塔夫,斯托卡,斯托克塞里,斯托约尔德,斯托罗,斯托尔维卡,斯特兰德,斯特劳门,斯特伦德内,苏达维克,苏杜雷里,松多亚,叙达伦,辛盖里,索尔拉克霍芬,索尔斯霍芬,恰尔纳比格德,约塔,托斯博滕,特雷尔内斯,特罗福斯,特罗内斯,特韦罗,乌尔夫斯沃格,温斯塔德,乌茨科尔,瓦拉,万德韦德,瓦尔马利德,瓦索斯,韦韦尔斯塔德,维德雷克,维克,维克霍尔门,沃加尔,沃格哈姆恩,沃普纳峡湾",
      },
      {
        name: "希腊语",
        i: 7,
        min: 1,
        min: 10,
        d: "s",
        m: 0.1,
        b: "阿布德拉,阿卡奈,埃盖,埃伊纳,阿格里尼翁,埃伊戈斯泰纳,阿克拉加斯,阿克罗伊农,阿克罗蒂里,阿拉利亚,亚历山大,阿马律托斯,阿马西亚,安菲卡埃亚,安菲耶内娅,安菲波利斯,安提帕特利亚,安提阿,阿帕梅亚,阿菲德纳,阿波罗尼亚,阿尔戈斯,阿特米塔,阿尔吉罗波利斯,阿斯克勒庇俄斯,雅典,阿特莫尼亚,布里托斯,博里斯泰内斯,布劳戎,比布鲁斯,拜占庭,比锡尼翁,卡吕冬,卡梅齐,哈尔基斯,希俄斯,克莱奥纳,科孚涛,克罗托内,昔兰尼,基西拉,德凯利亚,提洛涛,德尔斐,第凯阿查亚,迪迪马,狄翁,迪奥斯科里亚斯,多多纳,多利莱乌姆,埃拉提亚,埃莱夫西斯,埃莱utherna,恩波里翁,以弗所,埃皮达姆斯,埃皮达鲁斯,埃皮泽弗里安,埃雷特里亚,优卑亚,戈尔吉,贡诺斯,戈尔吉皮亚,古尔尼亚,戈尔廷,吉提翁,圣,哈利卡纳苏斯,赫利奥波利斯,赫勒斯滂,赫洛罗斯,赫拉克利亚,希拉波利斯,希梅拉,希斯特里亚,胡布拉,海勒,亚利苏斯,亚索斯,伊达里昂,伊姆布罗斯,伊奥尔科斯,伊塔诺斯,伊萨卡,尤克塔斯,卡利波利斯,卡梅罗斯,卡里斯托斯,卡斯迈奈,凯波伊,基梅里孔,克诺索斯,科林斯,科斯涛,库里昂,基多尼亚,凯里尼亚,拉米亚,兰普萨科斯,劳迪西亚,拉皮索斯,拉里萨,莱贝纳,莱夫卡扎,莱卡昂,莱贝特拉,莱昂蒂诺伊,利莱亚,林都斯,利索斯,马格尼西亚,曼提尼亚,马拉松,马尔马拉,马萨利亚,麦加洛波利斯,麦加拉,梅塔蓬图姆,梅苏姆纳,米利都,莫尔甘蒂纳,穆莱,迈锡尼,米奥尼亚,米拉,迈尔梅基翁,米奥斯,瑙普洛斯,瑙克拉提斯,纳夫帕克托斯,纳克索斯,那不勒斯,尼米亚,尼西亚,尼科波利斯,宁法伊翁,尼萨,奥德索斯,奥尔比亚,奥林匹亚,奥林索斯,奥波斯,奥尔霍迈诺斯,奥里科斯,奥雷斯蒂亚斯,奥雷奥斯,翁克斯莫斯,帕加塞,帕莱卡斯特罗,潘多西亚,潘提卡派昂,帕福斯,帕加马,帕罗斯涛,佩盖,佩利翁,比雷埃夫斯,费斯托斯,法勒隆,法罗斯,皮塞库萨,菲利普波利斯,福西亚,皮纳拉,比萨,皮塔内,普拉塔亚,波塞多尼亚,波提狄亚,普塞拉,普西赫罗,普特勒奥斯,皮德纳,皮洛斯,皮尔戈斯,拉姆诺斯,里蒂姆纳,里帕埃,里齐尼亚,罗得涛,萨拉米斯,萨摩斯涛,斯基拉伊翁,塞琉西亚,塞马索斯,塞斯托斯,斯基德罗斯,西库昂,,锡诺普,西里斯,士麦那,索佐波利斯,斯巴达,斯塔吉罗斯,斯特拉托斯,斯廷法洛斯,锡巴里斯,叙拉古,塔拉斯,塔纳格拉,塔奈斯,陶罗梅尼翁,泰格亚,泰姆诺斯,泰奥斯,塔普苏斯,萨索斯,底比斯,费奥多西亚,塞尔马,塞斯皮埃,特罗尼翁,托里科斯,图里,提雷乌姆,提里亚,提托雷亚,托米斯,特拉古里翁,的黎波里,特罗利通,特洛伊,提利索斯,提罗斯,瓦西佩特罗斯,扎金索斯,扎克罗斯",
      },
      {
        name: "拉丁语",
        i: 8,
        min: 1,
        min: 10,
        d: "ln",
        m: 0.1,
        b: "阿比拉,阿德弗莱克苏姆,阿德尼克雷姆,埃利亚,埃利乌斯,埃米尼乌姆,埃奎姆,阿格里皮娜,阿格里皮娜e,阿拉,阿尔巴尼亚尼斯,阿莱里亚,安比阿努姆,安达托尼娅,阿普卢姆,阿奎埃,阿奎埃格拉尼,阿奎因赛斯,阿奎莱亚,阿昆库姆,阿拉埃,阿根托拉图姆,阿里米努姆,阿斯克里维乌姆,阿斯图里卡,阿特雷巴图姆,阿图阿图卡,奥古斯塔,奥雷利亚,奥雷利亚诺鲁姆,巴塔瓦尔,巴塔沃鲁姆,贝卢姆,比里恰纳,布莱斯蒂乌姆,博纳米斯,博纳,波诺尼亚,博尔贝托马古斯,博维乌姆,布拉卡拉,布里甘蒂乌姆,布尔戈杜努姆,凯撒奥古斯塔,凯撒里亚,凯撒马古斯,卡莱瓦,卡姆洛杜努姆,坎斯塔特,坎蒂亚科鲁姆,卡皮托利纳,卡拉利斯,卡斯泰卢姆,卡斯特拉,卡斯特鲁姆,奇巴拉埃,克劳森图姆,科洛尼亚,孔坎吉斯,孔达特,康弗伦特斯,科宁布里加,科杜巴,科里亚,科里埃尔涛沃鲁,科里尼姆,科里奥瓦卢姆,科尔诺维奥鲁姆,达努姆,德瓦,迪亚尼姆,迪沃杜鲁姆,多布努奥鲁姆,德鲁西,杜布里斯,杜姆诺尼奥鲁姆,杜尔诺瓦里亚,杜罗科比维斯,杜罗科诺维乌姆,杜罗利普翁特,杜罗韦鲁姆,杜罗维古图姆,埃博拉库姆,埃布苏斯,埃代塔诺鲁姆,埃梅里塔,埃莫纳,恩波里亚,欧拉克尼,法文蒂亚,弗拉维伊,弗洛伦蒂亚, 弗拉姆,杰鲁拉塔,赫伦达,格索斯克里巴特,格莱文西乌姆,哈德良尼,赫库兰尼姆,伊斯卡,意大利卡,尤利娅,尤利奥布里根西乌姆,尤瓦夫姆,拉克托杜鲁姆,拉根蒂乌姆,拉普杜姆,劳里,莱吉奥尼斯,莱马尼,伦蒂亚,莱皮迪,莱托凯图姆,林迪尼斯,林杜姆,利克苏斯,伦迪尼乌姆,洛波杜努姆,卢松纳,卢库斯,卢格杜努姆,卢古瓦利乌姆,吕泰西亚,曼库尼乌姆,马尔索尼娅,马蒂乌斯,马萨,马西利亚,马蒂洛,马蒂亚科鲁姆,梅迪奥拉努姆,莫德,莫贡蒂亚库姆,莫里杜努姆,穆尔萨,奈苏斯,内尔维娅,尼达,尼格鲁姆,诺瓦埃西乌姆,诺维奥马古斯,奥利卡纳,奥利西波,奥维拉瓦,帕里西奥鲁姆,帕蒂斯科姆,帕特尔娜,皮斯托里亚,普拉森提亚,波伦提亚,波马里亚,庞贝,蓬斯,波尔图斯,普拉托里亚,普拉托里乌姆,普卢姆,拉古西乌姆,拉泰,劳里卡,拉文纳,雷吉娜,雷吉乌姆,雷古拉比乌姆,里戈马古斯,罗马,罗穆拉,鲁图皮亚厄,萨拉索奥鲁姆,萨勒诺,萨洛纳,斯卡拉比斯,塞戈维亚,西卢鲁姆,西米乌姆,西斯西亚,索尔维奥杜鲁姆,苏梅洛琴纳,塔拉科,陶里诺鲁姆,塞兰达,特雷伊克图姆,特雷维罗鲁姆,通格鲁姆,图尔西库姆,乌尔皮亚,巴伦西亚,威尼斯,文塔,维鲁拉米乌姆,韦松蒂奥,韦特拉,维克托里亚厄,维克特里克斯,维拉,维米纳基乌姆,温德利科奥鲁姆,温多博纳,维诺维亚,维罗科尼乌姆",
      },
      {
        name: "芬兰语",
        i: 9,
        min: 1,
        min: 10,
        d: "akiut",
        m: 0,
        b: "安内科斯基,阿莱宁,阿霍兰瓦拉,阿赫塔里,艾亚拉,阿卡,阿拉亚尔维,安茨拉,阿斯波,贝纳斯,比约尔科比,埃尔瓦,埃马萨洛,埃斯波,埃塞,埃维茨科格,福尔萨,哈帕马基,哈帕维西,哈普萨卢,哈梅林纳,汉科,哈尔亚瓦尔塔,哈图瓦拉,豪塔亚尔维,哈武马基,海诺拉,赫塔,欣卡博莱,希尔穆拉,霍萨,胡伊廷恩,胡苏拉,赫律拉,赫文卡,伊卡利宁,伊斯克莫,伊塔科斯基,雅姆萨,雅尔文帕,耶波,约埃苏,约格瓦,约恩苏,约基库拉,荣松,卡马斯穆卡,卡亚尼,卡拉约基,卡拉斯特,坎卡恩帕,卡尔库,卡尔潘库拉,卡斯基宁,卡斯纳斯,考哈约基,考哈瓦,考尼艾宁,考瓦查,凯赫拉,凯洛科斯基,凯洛蒂亚尔维,凯米,凯米亚尔维,凯拉瓦,科鲁,基乌鲁韦西,基韦斯亚尔维,基维奥利,基维苏奥,克劳卡拉,克洛夫斯科格,科赫特拉亚尔韦,科凯马基,科科拉,科尔霍,科斯库埃,科特卡,考瓦,考品基,库霍,库恩达,库奥皮奥,库雷萨雷,库里卡,库萨莫,库尔马兰库拉,拉赫蒂,莱蒂拉,兰基波哈,兰西库拉,拉普阿,劳里拉,劳蒂奥萨里,莱姆帕拉,勒普萨马,列达卡拉,列伊斯卡,利托宁,洛哈,洛伊马,洛克萨,洛维萨,马尔米,曼塔,马塔斯瓦拉,莫拉,米卢兰塔,米奥萨库拉,穆纳皮尔蒂,穆斯韦,穆拉海宁,南塔利,纳帕,纳尔皮奥,尼尼马,尼尼萨洛,尼基拉,尼尔西亚,尼瓦拉,诺基亚,努梅拉,努奥尔加姆,努武斯,奥布纳斯,奥蒂,奥亚卡拉,奥宁嫩,奥里马特蒂拉,奥里维西,奥坦马基,奥塔瓦,奥特帕,奥莱宁,奥卢,帕沃拉,帕伊德,帕伊米奥,帕坎库拉,帕尔迪斯基,帕莱宁,帕尔库马基,帕罗拉,佩尔图拉,皮耶克萨马基,皮奥尔萨马,皮奥尔瓦,波哈亚尔瓦,波尔霍拉,波拉萨,波尔沃,普达斯亚尔维,普尔莫,皮哈亚尔维,拉赫,拉塞波里,赖西奥,拉亚马基,拉克韦雷,拉皮纳,劳马,劳蒂奥,雷波萨里,里希马基,罗瓦涅米,罗伊卡,鲁奥纳拉,鲁奥塔拉,鲁塔拉赫蒂,萨里亚尔维,萨洛,萨斯塔马拉,绍埃,萨沃林纳,塞纳约基,锡拉梅,西翁蒂奥,松普亚尔维,苏奥嫩约基,苏雷雅尼,锡尔延塔卡,塔姆萨卢,塔帕,特梅斯,蒂奥尔瓦,托尔马森瓦拉,托尔尼奥,托蒂亚尔维,图尔皮奥,图伦基,图里,图卡拉,图拉拉,图里,图斯基,图斯涅米,乌尔维拉,乌纳里,乌皮尼埃米,乌蒂,乌西考品基,瓦克瑟,瓦利马,瓦林马亚,瓦萨,瓦伊尼卡拉,瓦尔加,瓦尔凯亚科斯基,万塔,瓦尔考斯,维赫卡佩拉,维赫马斯马基,维基,维鲁马基,维塔萨里,维扬迪,维尔普拉,维奥赫马,维奥鲁,维拉特,伊利克,伊利维斯卡,伊洛亚尔维",
      },
      {
        name: "朝鲜语",
        i: 10,
        min: 1,
        min: 10,
        d: "",
        m: 0,
        b: "安中,安山,安城,安养,牙浦,阿浦,白石,白水,卜谷,报恩,宝城,釜山,扶余,昌宁,昌原,天安,清道,清津,青松,青阳,铁原,漆原,春川,忠州,大德,大伽倻,大田,潭阳,唐津,多沙,东海,铜松,道阳,彦阳,开城,江景,江华,江陵,杆城,加云,居昌,巨济,乾川,金湖,金日,锦旺,机张,金泉,金化,金堤,高牙,高敞,高韩,公道,公州,高城,高阳,龟尾,君浦,群山,九里,求礼,光州,光阳,冠山,京城,咸昌,咸平,咸悦,陜川,河阳,兴南,洪农,洪城,华川,欢岛,华城,和顺,花园,香南,仁川,麟蹄,裡里,长项,长兴,长城,长承浦,长水,堤川,济州,店村,井邑,井关,井州,井玉,旌善,全州,智岛,稷山,镇安,鎭川,珍岛,晋建,津接,镇南浦,晋营,朝天,鳥致院,祖里,麻浦,万景,木浦,茂朱,内秀,南海,南原,农工,论山,梧川,玉川,沃沟,温岩,温山,温阳,梧浦,平城,葡谷,浦升,丰山,平昌,平海,泗沘,泗川,三陟,三湖,三礼,山清,上洞,尚州,沙桥,沙里院,世宗,瑞川,西归浦,城欢,城津,星州,城南,城山,瑞山,承州,始兴,新洞,新泰仁,素屿,束草,松岳,松汀,松林,松炭,顺天,泰安,太白,通津,议政府,宜宁,仪旺,蔚珍,郁陵,云凤,雄川,雄津,倭馆,莞岛,外阳,慰礼城,元德,醴泉,盐峙,灵岩,盈德,新义州,价川,南浦,清津,惠山,咸兴,咸山,端川,元山,德川,金野,定州,南兴,高原,龙川,普天堡,价南,文德,昌城,胜湖,丰渊,价周,熙川,长津,长德,美林,龙登,胜川,德山,熙涧,价北,价岩,茂山,价岭,云山,荣元,新岩",
      },
      {
        name: "汉语",
        i: 11,
        min: 1,
        max: 10,
        d: "",
        m: 0,
        b: "安定,安陆,安庆,安顺,百兴,板阳,宝庆,滨州,曹州,长白,长春,常德,长岭,长沙,常州,成都,郴州,池州,重庆,楚雄,滁州,大定,大名,大同,大兴,德庆,迪化,定黎,东安,东昌,东川,东平,都匀,奉天,凤翔,凤阳,汾州,抚宁,福州,赣州,高要,高州,巩昌,广南,广宁,广平,广信,广州,贵阳,海龙,杭州,汉阳,汉中,黑河,河间,河南,恒州,河中,淮安,怀庆,黄龙,黄州,会宁,呼兰,湖州,嘉定,建昌,江宁,建康,嘉兴,嘉阳,吉林,济南,靖江,京兆,金华,锦州,九江,开封,开化,康定,夔州,莱州,连州,辽阳,丽江,临安,临潢,临洮,黎平,柳州,龙安,龙江,龙兴,鲁宾,泸州,密山,南安,南昌,南甸,南康,嫩江,宁波,宁国,宁武,宁夏,宁远,平江,平凉,平阳,普洱,蒲州,黔州,庆阳,清远,青州,曲靖,衢州,饶州,仁德,瑞安,瑞州,邓州,沙峰,沙井,韶庆,邵武,绍兴,韶州,石南,石阡,寿春,双城,树垒,顺德,顺天,朔平,思南,泗州,松江,绥定,绥化,遂宁,苏州,泰安,台北,太平,台湾,太原,台州,洮南,腾冲,汀州,铜川,同庆,通州,卫辉,温宿,温州,武昌,武定,梧州,长安,咸淳,咸平,细金,西凉,新城,新安,兴德,兴化,兴泾,兴义,兴元,兴中,西宁,新门,西平,宣化,循州,徐州,延安,扬州,延吉,延平,兖州,崖州,宜昌,宜都,依兰,伊犁,营昌,英德,应天,郢州,永昌,永平,永顺,原州,岳州,玉林,云南,云阳,泽州,漳州,肇庆,昭通,镇安,真定,镇海,镇江,镇西,镇筠,中山,遵义,武威,交河,高昌,姑臧,涿州,冀州,幽州,并州,代州,雁门,云州,辽西,榆林,延州,绛州,潞州,太府,凤州,隆庆,襄平,浔阳,通化,石门,桐城,集宁,安州,陇西,钟祥,邕州,思明,嘉峪关,巫山,霍州,新郑,高密,台山,兰陵,揭阳,汕头,潮阳,瓯越,句容,临沂,宜兴,铜仁,黔南,马鞍山,芜湖,宿迁,阜阳,六安,蚌埠,淮北,淮南,宣城,亳州,鹤壁,濮阳,三峡,焦作,许昌,漯河,平山,周口,邑扶,商丘,天水,庆城,定西,陇南,武都,张掖,金昌,白银,酒泉,景德镇,鹰潭,萍乡,新余,广昌,南丰,宜春,赣县,德安,瑞昌,宁都,临川,吉安,龙南,新干,遂川,龙岩,三明,莆田,南平,宁德,福清,安溪,永安,建瓯,邵阳,常宁,怀化,耒阳,张家界,湘潭,湘西,汨罗,临湘,沅江,娄底,涟源,泠江,乐昌,廉江,恩平,从化,高明,罗定,雷州,吴川,阳春,增城,新会,开平,鹤山,玉川,铜石,赤云,飞莲,苍山,玉汝,雾岭,烈风,碧江,巨桑,赤壁,玄凤,鬼方,句芒,昆仑,无终,青丘,凤阙,驺虞,九嶷,蓬华,昭余,离朱,三苗,大荒,张家,周户,陈庄,仁义,香炉,福德,千佛,禅风,景竹,织锦,石作,曲艺,安边,镇夷,东卫,平虏,固北,镇中,怀义,合德,昭安,同光,安武,宁靖,永靖,忠信,左台,兴义,东泉,北川,合岭,昌林,金原,舟溪,西南,新蒲,浦安,龙屿,双义,瑞丰,汉东,元丰,燕南,铜梁,滨山,凤陵,兴渝,汉原,北京,上海,天津,深圳,武汉,南京,苏州,沈阳,青岛,郑州,大连,佛山,厦门,合肥,昆明,常山,海口,拉萨,银川,南宁,威海,烟台,包头,潍坊,唐山,惠州,淄博,南通,江门,盐城,廊坊,咸阳,临沂,天港,桂林,岳阳,株洲,荆州,荆门,洛阳,邺城,雒阳,平阳,上林,雍丘,邯郸,曲阜,彭城,建业,晋阳,宛丘,洺州,汝南,邢台,涿郡,郢都,衡阳,彝陵,彝州,巴郡,冀州,益州,交州,梁州,秦州,朔方,零陵,广汉,广陵,北平,扶风,鄯善,庐江,河东,晋陵,渤海,平原,建宁",
      },
      {
        name: "日语",
        i: 12,
        min: 1,
        max: 10,
        d: "",
        m: 0,
        b: "安比拉,阿贺,相川,会津美里,蟹田,厚岸,天城,网走,安藤,浅川,芦北,磐梯,美浓,府中,富士见,船形,玄海,御堂,五霞,五所川原,玉名,羽幌,滨顿别,播磨,箸尾,林岛,平群,日高,东浦,平内,广川,广尾,保达津清水,伯耆,北荣,北龙,幌加内,伊比川,市来,市川,一户,饭岛,饭綱,井川,猪名川,板仓,岩泉,岩手,开成,上富良野,神板,神岛,神川,上士幌,神山,神田,神奈,笠木,春日谷,胜浦,川边,川本,川根本町,川西,川原,川崎,川棚,川津,纪北,木古内,金,木曾,北方,北岛,清山,清里,甲府,古阁,湖北,九重,虎杖浜,琴浦,琴平,九度岭,久米岛,久米南,熊山,国富,仓岳,串本,倶知安,京南,京丹波,增毛,松前,三船,美滨,南部,美浓市,南越前,南种子,岬,三朝,美郷,美里,宫代,宫城,森,茂尻,睦泽,长泉,长户,长野,长与,和,中泊,中之条,中标津,滑川,南幌,直岛,那须,二世古,西原,西伊豆,西桂,西川,西之岛,西和贺,野木,能登,入善,大洗,小布施,大台,小川原,大春,追分,大石田,大磯,大泉,大治,大野,大阪,乙部,大月,尾上,尾张,礼东北,利府,利别,利尻,六户,龙雄,坂,佐久穗,佐波,萨摩,佐用,佐佐,濑棚,積丹,柴山,鹿岛,岛牧,岛本,清水,新富,白川,志津川,设乐,壮滨,末武,周防大岛,寿都,田布施,立飞,只见,多田冈,太地,太极,高千穗,高浜,竹丰,多良木,立科,辰乡,田原本,弟子屈,户边,常川,富冈,殿町,土佐,丰藏,丰臣,丰山,津幡,津别,月形,都野,海,若狭,山本,山边,山津,柳津,安艺,安田,余市,与那国,横轮,吉野,汤别,汤原,由仁,梼原,湯沢,天桥立,镰仓,箱根,伊豆,富士山,北海道,奈良,札幌,京都,冲绳,鹿儿岛,松江,金泽,松山,高知,鸟取,青森,宫崎,仙台,彦根,佐贺,福井,长崎,熊本,岐阜,滨松,福岛,弘前,岚山,秋田,飞驒,高松,宫岛,汤布院,筑波,越前,富良野,白滨,明石,黑部,御殿场,佐渡,川越,舞鹤,根室,鞠子",
      },
      {
        name: "葡萄牙语",
        i: 13,
        min: 1,
        min: 10,
        d: "",
        m: 0.1,
        b: "阿布里加达,阿丰索埃罗,阿瓜达,阿吉拉达,阿拉戈阿斯,阿拉戈因哈斯,阿尔布费拉,阿尔卡涅什,阿尔科巴萨,阿尔库廷,阿尔多阿尔,阿连克尔,阿尔费泽朗,阿尔加维,阿尔马达,阿尔马格雷拉,阿尔梅林,阿尔帕良,阿尔佩德林哈,阿尔沃拉达,阿米耶拉,阿纳波利斯,阿佩拉桑,阿拉尼亚什,阿尔加尼尔,阿尔马桑,阿森塞拉,阿维鲁,阿韦拉尔,巴尔萨斯,巴尔卡雷纳,巴雷拉斯,巴雷图斯,巴塔利亚,贝拉,贝纳文特,贝廷,布拉加,布拉干萨,巴西利亚,布雷若,卡贝塞拉什,卡贝德洛,卡肖埃拉什,卡达法伊斯,卡兰德里斯,卡尔赫塔,卡米尼亚,坎皮纳斯,卡尼德洛,卡诺阿斯,卡皮尼亚,卡尔莫伊什,卡尔塔什,卡尔瓦尔哈尔,卡沃埃罗,卡斯卡韦尔,卡斯塔纳尔,卡希亚什,查帕迪尼亚,沙维什,科凯什,科恩特拉尔,科英布拉,科姆波尔塔,孔德,科奎里尼奥,科鲁谢,达迈亚,多拉多斯,恩沙梅什,埃里谢拉,埃维德尔,埃斯卡良,埃斯莫里斯,埃斯皮尼亚尔,埃斯特拉,埃斯托里尔,埃乌纳波利斯,埃武拉,法马利康,范霍埃斯,法鲁,法蒂玛,费尔盖拉什,费雷拉,菲格拉,弗莱谢拉什,弗洛里亚诺波利斯,福纳利亚什,福塔莱萨,弗雷里亚,弗雷谢拉,弗朗特拉,丰当,格拉萨斯,格拉迪尔,格拉尼奥,格拉莱拉,吉马朗伊斯,奥尔塔,伊拉沃,伊莱乌斯,拉热什,拉各斯,拉兰杰拉什,拉瓦科柳什,莱里亚,利莫埃罗,林亚雷什,里斯本,隆巴,洛尔沃,洛里卡尔,洛林哈,卢西亚尼亚,马塞多,马查瓦,马尔维拉,马林哈伊什,马克西亚尔,梅亚尔达,米利亚拉多,米拉,米兰德拉,莫加多罗,蒙塔莱格雷,莫朗,内斯佩雷拉,尼洛波利斯,奥比多斯,奥德米拉,奥迪维拉什,奥埃拉什,奥雷罗斯,奥哈尔沃,奥林达,奥利瓦尔,奥利维拉,奥利维林哈,帕雷罗斯,帕尔梅拉,帕尔米塔尔,潘皮略萨,潘塔纳尔,帕拉迪尼亚,帕雷莱罗斯,佩德罗西尼奥,佩戈埃什,佩纳菲耶尔,佩尼切,品霍,皮涅罗,庞巴尔,蓬塔尔,蓬蒂尼亚,波尔特尔,波尔蒂芒,夸尔特拉,克卢兹,拉马尔哈尔,雷博雷拉,累西菲,雷迪尼亚,里巴杜罗,里贝拉,里贝朗普,罗萨伊斯,萨布加尔,萨卡韦姆,萨格雷什,桑丁,桑加柳什,桑塔伦,桑托斯,萨里略什,塞沙斯,塞克塞泽卢,塞什库,席尔瓦雷斯,席尔维拉,锡尼昂,辛特拉,索布拉尔,索布拉林霍,塔布亚科,塔布莱罗,塔维罗,泰索索,特利亚多,特尔海多,特尔海鲁,托马尔,托雷拉,特兰科索,特罗维斯卡尔,瓦戈什,瓦尔泽亚,维拉什,维亚芒,维亚迪加尔,维迪格拉,维杜阿尔,维拉马尔,维梅鲁,维尼艾什,维多利亚",
      },
      {
        name: "纳瓦特尔语",
        i: 14,
        min: 1,
        min: 10,
        d: "l",
        m: 0,
        b: "阿卡普尔科,阿卡特佩克,阿卡特兰,阿卡索奇特兰,阿科尔曼,阿克托潘,阿库阿马纳拉,阿瓦卡特兰,阿尔莫洛亚,阿马库萨克,阿马纳尔科,阿马沙克,阿帕克斯科,阿佩塔蒂特兰,阿皮扎科,阿滕科,阿蒂萨潘,阿特拉科穆尔科,阿特拉佩斯科,阿托托尼尔科,阿克萨普斯科,阿索奇亚潘,阿索科马尼特拉,阿苏特拉,阿斯卡波查尔科,阿斯塔瓦坎,卡利马亚,卡尔纳利,卡尔普拉尔潘,卡莫特兰,卡普尔阿克,查尔科,查普尔阿坎,查普尔特佩克,奇亚潘,奇奥滕潘,奇科瑙特拉,奇瓦瓦,奇尔夸乌特拉,奇马尔瓦坎,乔洛兰,希瓦特兰,科阿韦拉,科阿特佩克,科阿特特尔科,科阿特兰,科阿特林昌,科阿察科阿尔科斯,科科蒂特兰,科赫萨拉,科利马,科洛特兰,科约阿坎,科约胡阿坎,夸皮亚斯特拉,夸乌纳瓦克,夸乌蒂特兰,夸乌特拉,夸索穆尔科,库尔华坎,埃卡特佩克,埃洛索奇特兰,埃帕特兰,埃帕佐尤坎,瓦曼特拉,瓦斯卡萨洛亚,瓦特拉特劳卡,瓦乌特拉,韦韦特兰,韦韦托卡,韦索特拉,韦亚潘,韦约特利潘,韦波克斯特拉,惠查潘,惠米尔潘,惠茨拉克,伊克斯塔帕洛坎,伊斯塔卡尔科,伊斯塔奇胡阿特尔,伊斯塔帕拉帕,洛洛特拉,马利纳尔科,马帕奇特兰,马萨特佩克,马萨特兰,梅特佩克,梅兹蒂特兰,墨西哥,米亚卡特兰,米乔阿坎,米纳蒂特兰,米斯科亚克,米克斯特拉,莫尔卡萨克,纳纳卡米尔帕,瑙卡尔潘,瑙潘,内克斯特拉尔潘,内萨瓦尔科约特尔,诺帕卢坎,瓦哈卡,奥科特佩克,奥科蒂特兰,奥科特兰,奥科约阿卡克,奥库伊兰,奥库伊图库,奥米特兰,奥托姆潘,奥佐洛阿潘,帕库拉,帕胡亚特兰,帕诺特拉,帕帕洛特拉,帕特拉奇坎,皮亚斯特拉,波波卡特佩特尔,苏尔特佩克,特卡马克,特科洛特兰,特科扎乌特拉,特马马特拉,特马斯卡拉帕,特米克索,特莫阿克,特莫亚亚,特纳尤卡,特诺奇蒂特兰,特奥库伊特拉特兰,特奥蒂瓦坎,特奥特拉尔科,特佩阿卡克,特佩阿普尔科,特佩胡阿坎,特佩蒂特兰,特佩扬科,特波佐兹特兰,特波兹特兰,特特卡拉,特特拉特拉胡卡,特什卡利亚卡克,特斯科科,特斯科科,蒂米尔潘,蒂扎潘,蒂扎尤卡,特拉科潘,特拉科滕科,特拉瓦克,特拉韦哈,托卡特兰,托尔卡尤卡,托卢卡,托纳尼特兰,托南津特拉,托纳蒂科,托托拉克,托托拉潘,托托特兰,图赫特兰,图兰特佩克,图尔特佩克,松潘特佩克,夏拉特拉科,夏洛斯托克,夏尔托坎,西洛霍克斯特拉,索奇亚蒂潘,索奇科阿特兰,索奇米尔科,索奇特佩克,索洛特兰,索纳卡特兰,亚华利卡,亚乌特佩克,耶卡皮斯特拉,耶豪尔特佩克,萨卡特卡斯,萨卡佐纳潘,萨科阿尔科,萨夸尔潘,萨夸尔蒂潘,萨波特兰,齐马潘,齐纳坎特佩克,佐亚尔特佩克,祖姆帕胡阿坎",
      },
      {
        name: "匈牙利语",
        i: 15,
        min: 1,
        min: 10,
        d: "",
        m: 0.1,
        b: "阿巴,阿巴德萨洛克,阿多尼,阿雅克,阿尔贝蒂尔萨,阿尔索佐尔察,阿索德,巴博尔纳,巴察尔马什,巴克塔洛兰塔扎,巴拉沙贾尔马特,巴拉通阿尔马迪,巴拉通博格拉尔,巴尔卡尼,巴尔马祖伊瓦罗斯,巴尔奇什,巴塔塞克,巴托尼特雷涅,巴托尼亚,贝凯什,贝雷蒂乌伊法卢,贝尔希达,比亚托尔巴吉,比奇克,比哈尔凯雷斯特什,博达伊克,博利,博尼哈德,布达卡拉斯,布达凯西,切尔多莫尔克,查克瓦尔,切恩格尔,乔斯格拉德,乔尔纳,乔尔瓦什,丘尔戈,达巴什,德梅策尔,德雷切克,德瓦瓦尼亚,德韦切尔,多姆博瓦尔,多姆布拉德,杜纳福尔德瓦尔,杜纳哈拉斯蒂,杜纳瓦尔萨尼,杜纳韦切,埃德莱尼,埃莱克,埃莫德,恩奇什,恩英,埃尔奇,费吉维尔内克,费尔索佐尔察,费尔托森特马克洛什,福尼奥德,福特,弗泽萨博尼,弗泽斯格拉马特,加尔多尼,戈德,吉亚尔,约马恩德罗德,约姆罗,海伊杜多罗格,海伊杜哈德哈兹,海伊杜桑姆松,海伊杜斯博绍,哈尔施特莱克,哈尔卡尼,哈特万,赫维什,赫维兹,伊布拉尼,伊萨谢格,伊扎克,雅诺沙尔马,雅诺什索莫尔亚,雅斯帕蒂,雅斯扎罗克萨拉什,雅斯芬尼斯扎鲁,雅斯基谢尔,卡巴,卡洛恰,卡普瓦尔,卡尔察格,凯切尔,凯梅切,肯德雷什,凯雷凯吉哈扎,凯斯泰利,基什贝尔,基什库恩迈沙,基什塔尔查,基斯泰莱克,基苏伊什萨拉什,基什瓦尔达,科马迪,科马罗姆,科姆洛,科尔门德,科罗斯拉达尼,科塞格,科扎尔米什莱尼,库内赫耶什,昆桑特马尔顿,昆桑特米克洛什,拉巴特兰,拉约什米兹,伦蒂,莱塔韦尔特什,莱特涅,洛林奇,马格洛德,马科,曼多克,马尔察利,马尔通瓦沙尔,马特萨尔卡,梅利库特,梅佐贝雷尼,梅佐察特,梅佐黑耶什,梅佐凯雷斯特斯,梅佐图尔,明兹森特,莫哈奇,莫诺尔,莫尔,莫拉哈尔姆,纳杜德瓦尔,纳贾亚塔德,纳杰切德,纳吉哈尔什,纳吉卡洛,纳吉科罗斯,纳吉马罗斯,尼凯拉达哈扎,尼尔杰舒伊法卢,尼伊尔巴托尔,尼伊尔马达,尼伊尔泰莱克,奥查,奥尔凯尼,奥罗斯兰,帕克什,潘农哈尔马,帕斯托,佩切尔,佩奇瓦拉德,皮利什沃罗斯瓦尔,波尔加尔,波尔加尔迪,波马兹,普什波克拉达尼,普斯塔萨博尔茨,普特诺克,拉察尔马什,拉切韦,拉卡马兹,拉科齐法尔瓦,萨约绍森特,桑多尔法尔瓦,沙尔博加尔德,萨尔卡德,萨罗斯帕塔克,萨尔瓦尔,萨托拉尔雅乌伊黑伊,希克洛什,西蒙托尔尼亚,索尔特瓦德凯尔特,苏梅格,萨巴兹萨拉什,萨尔瓦什,圣哥特哈德,圣洛林茨,塞伦茨,西盖塔洛姆,西盖特瓦尔,锡克索,塔布,塔马什,塔皮奥塞莱,塔波尔察,特格拉什,泰特,蒂萨福尔德瓦尔,蒂萨富雷德,蒂萨凯茨凯,蒂萨洛克,蒂萨乌伊瓦罗斯,蒂萨瓦斯瓦里,托凯,托科尔,托姆帕,托罗克巴林特,托罗克森特马克洛什,托特科姆洛什,图拉,图尔凯维,乌伊基约什,乌伊萨斯,瓦莫斯佩尔奇,瓦尔帕洛塔,瓦沙罗斯纳梅尼,瓦什瓦尔,维切什,韦雷谢吉哈兹,韦尔佩莱特,韦斯佐,扎霍尼,扎拉森特格罗特,齐尔茨,扎姆贝克",
      },
      {
        name: "土耳其",
        i: 16,
        min: 1,
        max: 10,
        d: "",
        m: 0,
        b: "耶尔卡亚,布尤鲁卡亚,厄尔登特佩,阿拉克森,巴哈贝伊,博兹拜,卡拉奥克鲁,阿尔图姆贝,亚尔卡莱,亚尔库特,阿卡尔德雷,阿尔塔伊布尔努,埃森特佩,奥克贝伦,德林苏,阿拉奥巴,亚曼贝伊,阿伊科尔,埃基诺瓦,萨兹特佩,巴哈尔卡莱,德夫雷克迪比,阿尔普塞基,奥尔曼塞基,厄尔卡莱,亚尔贝伦,阿伊塔伊,亚曼亚卡,阿尔塔伊德伦,埃森,耶迪耶里,阿尔普科尔,德米尔科尔,耶迪约尔,厄尔登卡亚,亚伊布尔努,加尼勒尔,巴亚图尔,科普兹特克,阿伊特佩,德尼兹,阿扬,阿亚兹德雷,特佩,凯拉,阿伊亚卡,德伦,阿达特佩,卡尔卡内利,博兹卡莱,耶迪德伦,科贾约卢,萨兹德雷,博兹塞森,奥古泽利,亚伊拉迪比,乌鲁约尔,阿尔塔伊,阿伊瓦尔,阿拉兹亚卡,亚尔奥巴,苏亚卡,巴尔塔贝里,波伊拉兹德伦,埃米尔,耶迪尤瓦,库尔特,耶尔特佩,奥克塔尔,卡拉奥克,埃基贝里,厄尔尤尔,厄伦,厄伦勒尔,谢尔,奥古兹,阿赛,博佐凯利,阿伊库特,奥尔曼约尔,亚兹卡亚,卡尔卡诺瓦,亚兹贝伊,多库兹特克,比尔格,厄尔腾苏尤,科普兹尤瓦,布尤鲁克特,阿卡尔迪肯,阿伊巴拉伊,阿斯兰贝伊,阿尔图恩凯纳克,阿提科巴西,亚伊拉埃里,科尔特佩,萨鲁雷利,科尔凯亚,阿伊巴尔贝里,凯梅瑞,亚纳雷,贝伊迪雷里,布尤鲁科巴,约尔杜曼,腾格里特佩,多库兹苏,乌宗科尔,厄尔登尤尔杜,凯梅尔,科尔特克,博兹奥克夫,博兹奥巴,奥尔曼卡莱,阿斯卡莱,奥古兹托普拉克,约尔贝里,昆塞基,埃森奥巴西,土尔克贝伦,阿亚兹塞基,切雷内利,塔库特,拜拉姆德伦,贝伊迪亚卡,博兹特佩,乌鲁奥巴,耶尔亚卡,乌尔加尔迪肯,埃森苏,拜卡莱,切雷科尔,博兹约尔,杜兰奥巴,阿拉杜曼,德尼兹利,巴哈尔,雅尔克森,多库泽尔,亚曼卡亚,科贾塔尔拉,阿拉亚卡,托普拉克埃利,萨尔普塔尔拉,萨尔普科伊,谢尔卡纳克,阿达亚卡,阿亚兹卡纳克,科普兹,图尔克,卡特,昆,厄尔腾,布尤鲁克,耶尔,阿达,阿拉佐瓦,阿伊瓦尔杜曼,布尤鲁科克,阿伊瓦尔托普拉克,乌宗特佩,宾塞基,耶迪贝伊,杜兰卡莱,阿拉佐托普拉克,萨尔普奥克,雅帕罗巴西,亚伊特佩,阿斯贝里,卡尔坎科尔,贝伊迪特佩,阿达贝里,比尔盖约卢,加尼尤尔特,阿尔坎特克,埃森尔勒尔,阿斯贝伊,厄尔登卡莱,厄尔恩卡纳克,奥古兹科尤,阿亚佐巴,博伊努兹托普拉克,奥科瓦,亚洛克鲁,西维里贝里,尤拉迪肯,萨兹贝伊,卡拉凯纳克,科普兹科尤,布尤鲁卡伊,科贾卡亚,特佩杜曼,亚纳尔塞基,阿提库尔特,埃森艾夫,阿卡尔贝伊,亚伊特克,德夫雷克松古尔,阿克塞基,巴亚库特,卡尔坎德雷,乌尔加罗瓦,德夫雷克夫,尤拉贝伊,巴亚特夫,亚兹苏,武拉埃勒,西维里贝伊利,阿拉欧巴西,阿尔波巴西,亚尔尤尔特,埃尔马托普拉克,阿拉佐凯纳克,埃森艾夫,萨鲁科尔,埃基诺克,亚尔贝伊,耶尔德雷,加尼拜,阿尔塔库特,巴尔塔博伊,厄雷利,阿伊瓦尔苏,乌宗萨兹,巴耶利,厄尔恩约尔,科贾巴耶,德林塔伊,阿亚兹约尔,阿斯兰欧巴,埃森凯纳克,埃基恩里克,阿尔皮约卢,阿拉远特,博泽斯基,厄尔基尔,杜兰苏尤,尤拉克,库特,多杜尔加,库特鲁贝伊,库特卢约尔,博伊努兹,阿拉约尔,阿伊巴尔,阿斯兰埃尼,凯梅尔塞基,巴尔塔苏尤,阿卡尔尔,阿伊瓦尔布尔努,博伊努兹贝伊,阿达松古尔,埃森科尔,亚曼欧巴,托普拉克科尔,乌宗尤尔特,松古尔,博佐克,凯梅尔利,阿拉兹,德米尔奇,卡尔特佩",
      },
      {
        name: "柏柏尔语",
        i: 17,
        min: 1,
        max: 10,
        d: "s",
        m: 0.2,
        b: "阿布库什,阿德拉尔,艾拉伊什,阿弗拉格,阿加迪尔,阿盖尔玛姆,阿格马特,阿格拉卡尔,阿古尔玛姆,阿哈加尔,艾特巴哈,阿吉尔,阿卡,阿尔穆,阿梅格杜尔,阿米兹米兹,阿姆纳斯,阿姆利尔,阿穆拉库什,安法,安纳巴,奥斯贾,阿尔巴特,阿尔富德,阿尔古布,阿里夫,阿斯菲,阿斯弗鲁,阿肖温,阿萨默尔,阿西夫,阿维卢兹,艾特梅勒勒,阿扎加尔,阿齐拉,阿齐拉尔,阿兹穆尔,阿兹罗,阿兹鲁,贝卡尔,贝贾,贝努尔,本斯利曼,贝尔卡内,贝雷希德,比泽尔特,比亚德,布艾亚赫,布德尼布,布夫拉,布斯库拉,布特费尔达,达拉卢什,达尔布阿扎,达尔查巴内,德切拉,德姆纳特,登登,杰贝尔,杰代达,德拉尔瓜,埃尔胡西马,埃萨维拉,埃扎赫拉,法斯,夫尼代克,格泽泽,古贝拉特,格里萨芬,盖尔米姆,盖尔西夫,哈马梅特,哈鲁达,赫迪法,霍塞伊马,霍瓦拉,伊丹,伊杜拉尔,伊芬达森,伊福加斯,伊弗拉讷,伊古德,伊克比尔,伊米尔奇尔,伊姆祖伦,伊内兹甘,伊尔赫尔姆,伊祖加尔,詹杜巴,卡塞姆,凯利比亚,肯尼特拉,凯兰多,哈利迪亚,赫米塞特,赫尼弗拉,胡里卜加,胡里格巴,基达尔,科尔巴,科尔布斯,拉赫劳伊耶纳,拉拉切,雷云,勒克利亚,马努巴,马尔蒂尔,马扎甘,姆谢尔加,姆迪克,梅格林,梅拉尔,梅卢尔,米德尔特,米苏尔,穆罕默迪亚,莫尔纳格,姆里尔特,纳布勒,纳杜尔,纳多尔,纳瓦克苏特,内夫扎,瓦尔扎扎特,瓦赞,瓦德泽姆,乌吉达,乌伊达特,克森蒂纳,拉德斯,拉夫拉夫,萨菲,塞夫鲁,塞纳内,塞塔特,西吉尔马萨,斯基拉特,斯利曼,索马,斯拉格纳,苏萨,塔巴尔卡,塔德拉特,塔费尔卡,塔菲拉尔特,塔夫劳特,塔夫扎,塔格巴鲁特,塔格尔达伊特,塔格兹特,塔凯尔萨,塔利乌因,坦贾,坦坦,陶里尔特,塔尔古伊斯特,塔鲁丹特,塔鲁丹特,塔斯费拉莱特,塔索尔特,塔塔,塔蒂温,塔瓦纳特,塔扎,塔扎古尔特,塔泽尔卡,塔齐扎乌特,塔兹纳赫特,特布尔巴,特布尔苏克,特马拉,特斯图尔,特图安,提贝斯克特,蒂费尔特,蒂吉迪特,蒂纳里温,廷杜夫,廷贾,蒂塔万,蒂兹尼特,图布卡尔,特拉布勒斯,图布卡尔,突尼斯,乌尔塔西拉,乌鲁普,瓦古滕,瓦拉尔尼,瓦尔扎扎特,瓦特拉斯,韦赫兰,韦贾达,哈米达,耶德尔,尤苏菲亚,扎古安,扎赫雷特,泽穆尔,兹里巴",
      },
      {
        name: "阿拉伯语",
        i: 18,
        min: 1,
        min: 10,
        d: "ae",
        m: 0.2,
        b: "阿布哈,阿治曼,阿拉巴尔,阿尔贾姆,阿拉什拉夫,阿拉瓦利,阿尔巴瓦迪,阿尔比尔克,阿尔达比亚,阿尔杜维德,阿尔法里克,阿尔盖德,阿尔哈齐姆,阿尔哈拉蒂姆,阿尔胡达伊达,阿尔胡韦亚,阿尔贾赫拉,阿尔朱贝尔,阿尔卡法,阿尔哈拉斯,阿尔哈瓦尼杰,阿尔肯,阿尔霍巴尔,阿尔胡兹纳,阿里萨法,阿尔姆沙伊赫,阿尔穆尔詹,阿尔穆维赫,阿尔穆扎伊利夫,阿尔纳希姆,阿尔纳希法,阿尔卡赫,阿尔库兹,阿尔库赖亚特,阿尔拉扎,阿尔拉克米亚,阿尔萨迪亚,阿尔萨法,阿尔沙加布,阿尔舒凯克,阿尔西拉,阿尔萨菲尔,阿尔瓦斯卡,阿马克,阿姆兰,阿纳西姆,阿克比亚,阿拉法特,阿拉尔,阿尔达,阿斯凡,阿沙伊拉,阿斯卡尔,阿亚尔,阿齐齐亚,巴埃什,巴赫拉,巴尔哈夫,巴尼扎伊德,比迪亚,比沙,比亚塔,布克海克,布赖达,达菲亚特,达马德,达曼,达里亚,达法尔,达赫兰,达尔库特,达赫尔马,迪巴卜,多哈,杜汉,杜瓦巴,埃纳克尔,法德拉,法哈希勒,法纳蒂尔,法拉桑,法尔达,富查伊拉,加利拉,加尔,盖兹兰,格霍姆吉亚,格兰,哈迪亚,哈法,哈詹巴,哈吉拉,哈卡克,哈拉德,哈萨尔,哈维亚,赫巴,赫法尔,希贾尔,胡斯纳,胡韦拉特,胡韦塔,伊尔卡,伊沙拉,伊斯拉赫,贾马拉,贾拉布,贾里夫,贾赞,吉达,吉布拉,吉哈纳,吉拉,吉赞,乔拉巴,朱班,朱美拉,卡马兰,凯亚德,哈布,海拜尔,哈萨布,哈斯蒂拉,哈瓦拉,胡莱斯,库姆扎尔,利马,利纳,马德拉克,马哈布,马哈拉赫,马克塔尔,马什瓦尔,马西拉,马斯利亚,马斯塔巴,马扎尔,麦地那,米卡特,米尔巴赫,莫赫塔拉,穆哈拉克,穆拉达,穆塞卡,穆谢里夫,穆斯拉,穆萨法,纳夫罕,纳吉兰,纳哈布,尼兹瓦,阿曼,卡达赫,卡尔哈特,卡姆拉,卡萨姆,科斯玛,库赖因,库里亚特,库尔瓦,拉达,拉夫哈,拉赫拉,拉卡马,拉希达,拉斯马德拉卡,里萨巴,鲁斯塔克,利雅得,萨布塔尔贾拉,萨达,萨菲纳,萨哈姆,赛哈特,萨拉拉,萨尔米亚,沙布瓦,沙利姆,沙克拉,沙尔贾,沙鲁拉,沙蒂菲亚,希达,希哈尔,肖克拉,舒瓦克,西巴,西哈玛,西纳乌,西尔瓦,索哈尔,苏哈伊拉,苏莱比亚,孙巴,塔布克,塔伊夫,塔卡,塔里夫,萨尔班,索克巴,图巴贾尔,图赖夫,图尔巴,图韦克,乌巴尔,乌马尔杰雷姆,乌拉亚拉,乌尔瓦,瓦布拉,瓦尔巴,雅布林,亚达玛,亚弗尔,亚里姆,也门,伊亚拉,扎比德,扎哈瓦,扎拉克,津吉巴尔,祖卢马",
      },
      {
        name: "因纽特语",
        i: 19,
        min: 1,
        min: 10,
        d: "alutsn",
        m: 0,
        b: "阿鲁伊克,阿帕拉托克,阿西亚特,阿吉萨特,阿格苏萨特,阿库利亚鲁茨普,阿库纳克,阿鲁伊特苏普,阿卢托克,阿米索苏亚克,阿玛萨利克,阿纳鲁苏克,安古尼亚尔塔尔菲克,安奈尔图索克,阿尼基措克,阿帕尔斯伊特,阿普西亚亚季克,阿尔西维克,阿尔苏克,阿塔米克,阿特卡纳克,阿提利苏阿克,阿图,阿乌普帕卢格托克,阿乌卡尔内尔斯鲁阿克,阿乌玛特,阿乌维尔基卡夫绍普,阿瓦德特莱克,阿瓦勒苏阿克,比约尔内斯克,布拉贝尔达伦,布洛姆斯特达伦,布拉特阿尔希德,布雷德布雷,布雷德达尔,克劳斯哈文,埃德德富勒格尔,埃格尔,埃卡鲁加林努伊特,埃卡鲁加尔苏伊特,埃卡鲁伊特,埃夸,埃塔,格拉,哈克鲁伊特,哈雷达伦,哈勒恩,洪德奥,伊加利库,伊格德洛尔苏伊特,伊格德卢阿尔苏克,伊金尼亚菲克,伊卡米特,伊卡里萨特,伊卡泰克,伊克米乌特,伊克尔米乌特苏阿克,伊科尔法尔苏伊特,伊利马纳克,伊洛尔苏伊特,伊卢努伊特,伊卢伊勒克,伊卢利萨特,伊马尔西维克,伊马尔图纳尔苏克,伊莫基托苏卡吉克,伊纳尔苏伊特,伊内鲁拉利克,伊努苏利苏阿克,伊佩拉克,伊皮克,伊克克,伊索尔托克,伊松加图索克,伊蒂莱克,伊蒂萨利克,伊蒂夫德勒克,伊蒂特,伊图科尔托尔米特,伊文米乌特,伊维图特,卡纳乔拉图特,康加米乌特,康格克,康格鲁克,康格卢苏阿克,卡皮西利特,凯克尔塔米特,基亚塔克,基阿陶萨克,基加塔克,基瑙萨克,金吉托尔苏阿克,基塔克,基齐苏阿尔苏伊特,基齐苏苏特,克伦茨纳,库克,克劳尔斯哈芬,库亚莱克,库洛尔苏阿克,库鲁米特,库苏阿克,拉克塞达伦,马尼索茨,马拉卡伊克,马塔安加苏特,梅尔诺克,米蒂瓦卡特,莫里乌萨克,米格布克塔,纳贾特,南吉萨特,纳努塞克,纳帕索克,纳尔萨尔米特,纳尔萨尔苏克,纳西菲克,纳西阿西奥尔菲克,纳乌扬圭特,尼亚科尔纳尔苏克,尼亚科尔纳特,诺尔德峡湾,努加茨亚克,努纳尔西特,努纳鲁苏克,努纳塔克瓦绍普,努塔阿尔米乌特,努阿加茨亚克,努克,努库拉克,奥隆金比恩,乌达克,奥卡茨特,奥凯茨翁圭特,奥科内尔米乌特,帕古萨特,帕米阿卢克,佩尔塞拉乔克,皮图菲克,普古塔,普乌尔库伊普,卡纳克,卡苏伊楚普,卡苏尔特苏恩圭特,卡奥内尔米乌特,拉弗内达伦,里滕本克,赖佩达伦,萨尔洛克,萨托苏尔克,萨图特,萨利亚鲁塞克,萨梅卡特,萨米索克,萨宁加索克,萨卡克,萨卡勒尔苏克,萨卡尔利特,萨尔凡古伊特,萨蒂亚泰克,萨维斯西维克,塞尔方瓜克,塞尔梅苏克,塞米利嘎克,塞米利克,塞尔密斯,西米塔卡贾,西米乌塔克,辛加马克,西奥拉帕卢克,西西米乌特,西苏阿苏特,苏洛尔苏阿克,苏尼卡季克,斯韦尔德鲁普,塔尔托克,塔基塞克,塔西尔利亚克,塔西乌萨克,提勒里拉克,提米勒苏阿,提米阿尔米乌特,图金加索克,图萨克,图图利苏普,图朱克,乌伊瓦克,乌伊洛尔图索克,乌贾阿卡吉普,乌库西萨特,乌佩尔纳维克,乌托尔苏蒂特,乌马纳克,乌纳尔托克,乌夫库西格萨特,伊默尔",
      },
      {
        name: "巴斯克语",
        i: 20,
        min: 1,
        min: 10,
        d: "r",
        m: 0.1,
        b: "阿古赖恩,艾亚,艾亚拉,阿尔比兹图尔,阿尔基扎,阿尔察加,阿莫雷比埃塔,阿穆里奥,安多因,阿诺埃塔,安苏奥拉,阿拉卡尔多,阿兰察祖,阿尔巴茨埃吉,阿雷阿查,阿拉苏阿,阿尔里埃塔,阿尔特赛涅加,阿斯特阿苏,阿斯蒂加拉加,阿陶恩,阿特松多,奥莱斯蒂,阿兹科伊蒂亚,阿兹佩伊蒂亚,巴基奥,巴利阿赖因,巴拉卡尔多,巴里卡,巴伦迪亚,巴绍里,贝亚萨因,贝迪亚,贝扎马,贝朗扎,贝拉斯塔,贝拉斯特吉,贝尔加拉,贝尔梅奥,贝尔内多,贝里亚图阿,贝里兹,比达尼亚,比拉尔,比尔巴鄂,布斯图里亚,德巴,德里奥,多诺斯蒂亚,杜兰戈,埃亚,埃巴尔,埃兰乔贝,埃尔杜因,埃尔盖塔,埃尔戈伊巴尔,埃洛里奥,埃兰迪奥,埃尔戈伊蒂亚,埃尔穆阿,埃伦特里亚,埃雷齐尔,埃斯科里亚查,埃斯库埃尔纳加,埃彻巴里,埃切巴里亚,埃斯基奥,福鲁阿,加比里亚,盖恩察,加尔达考,加米兹,加赖,加斯泰斯,加查加,格尔尼卡,格里卡茨,盖塔里亚,盖乔,吉萨布鲁阿加,戈亚茨,戈利兹,戈里亚加,哈拉纳,赫尔纳尼,洪达里比亚,伊巴拉,伊巴兰格鲁,伊迪亚萨巴尔,耶科拉,伊戈雷,伊卡兹特吉埃塔,伊伦,伊鲁拉,伊鲁赖斯,伊察索,伊察松多,伊乌雷塔,伊祖尔察,贾塔贝,坎佩祖,卡兰坦萨,科尔滕祖比,克里潘,夸尔坦戈,拉内斯托萨,兰齐埃戈,拉拉贝楚,拉萨尔特,劳基斯,拉斯考,雷阿布鲁,莱加兹皮,莱戈雷塔,莱古蒂奥,雷因茨,雷奥亚,雷凯蒂奥,莱基蒂奥,莱莫阿,莱莫伊斯,雷扎,雷萨马,雷佐,利萨尔察,马埃苏图,马拉比亚,马纳里亚,马尔基纳,马鲁里,梅纳卡,门达罗,门达塔,门德沙,莫尔加,蒙达卡,蒙吉亚,穆尼蒂巴尔,穆鲁埃塔,穆斯基兹,穆蒂洛阿,穆特里库,纳巴尔尼兹,奥亚尔茨恩,奥永,奥孔多,奥拉贝里亚,奥拉兹科,奥拉乌兹,奥尔迪西亚,奥伦达因,奥雷哈,奥里亚,奥里奥,奥尔迈茨特吉,奥罗兹科,奥尔图埃利亚,奥特吉,奥查迪奥,奥奇安杜,帕萨亚,普伦西亚,桑图尔茨,塞斯陶,松迪卡,索拉卢塞,苏卡里埃塔,托洛萨,特拉帕加兰,图尔齐奥兹,乌巴伦迪亚,乌比德,乌加奥,乌尔杜阿,乌尔杜利斯,乌里萨哈拉,乌尔卡布斯泰兹,乌尔涅塔,乌雷楚,乌苏尔比尔,谢梅因,萨巴莱塔,扎伊亚,扎尔迪巴尔,赞布拉纳,扎穆迪奥,扎拉塔莫,扎劳兹,泽贝里奥,泽加马,泽雷因,泽斯托亚,齐埃尔贝纳,齐戈伊蒂亚,齐奥尔察,祖伊亚,祖迈亚,祖马拉加,祖马拉加",
      },
      {
        name: "尼日利亚语",
        i: 21,
        min: 1,
        max: 10,
        d: "",
        m: 0.3,
        b: "阿巴多戈,阿巴冯,阿德阿勒苏,阿德托,阿迪翁果,阿法加,阿法姆朱,阿吉比吉,阿戈戈克,阿胡特,阿耶拉博罗,阿杰贝,阿乔拉,阿卡雷库,阿库努巴,阿拉沃德,阿尔凯吉,阿曼甘姆,阿姆格巴耶,阿姆塔萨,阿穆尼贡,阿尼马洪,阿尼约科,阿拉帕吉,阿桑德,阿乌格巴巴,阿乌胡姆,阿沃杜,巴巴特杜瓦,班达夸伊,班格迪,比利卡尼,比尔宁多多,布莱杜,布拉卡瓦,布里布里,凯南,查库姆,乔恩杜格,达格瓦尔加,达尔皮,多卡托法,多泽雷,埃贝利布里,埃费姆,埃科库,埃克佩,埃沃埃维里,加莱亚,加门,甘金,甘特图杜,加尔加尔,加林博德,格布雷,格尔蒂,吉丹,吉塔巴雷穆,吉亚吉里,吉亚瓦,格马瓦,戈拉科奇,戈伦巴,贡吉,格瓦姆布拉,格沃多蒂,哈因勒雷,哈因迈亚莱瓦,希里希,洪博,伊贝弗姆,伊贝雷科多,伊查尔奇,伊多芬,伊多菲诺卡,伊格博戈,伊乔科,伊朱瓦,伊卡乌加,伊赫因,伊克帕基杜特,伊克佩奥尼翁,伊穆奥戈,伊帕沃,伊平勒雷雷,伊西查,伊塔克帕,詹吉,贾雷,贾陶达库姆,贾乌罗戈姆基,杰佩尔,卡芬马拉马,卡塔布,卡坦加,卡廷达,卡蒂里耶,考拉金巴,凯芬沙努,凯卢米里,基阿格博多尔,基尔布图,基塔,科戈戈,科普杰,科罗科罗塞伊,科托库,夸塔,库朱姆,库考,昆布恩,夸努博格贝内,库拉韦,库希纳胡,夸拉马克里,拉迪梅吉,拉菲亚罗,拉哈加,兰德巴贾恩勒,兰德戈罗,拉卡蒂,利滕斯瓦,马巴,马达尔扎伊,迈阿尼塔,马里坎萨,马塔,梅戈约,梅库,米阿马,莫迪,姆希,姆苏格,穆杜武,穆尔纳切胡,纳姆奈,恩达曼马,恩迪乌伦贝,恩多努蒂姆,恩格班德,恩格恩古,恩托埃克佩,恩亚乔,恩约尔,奥达杰,奥格巴加,奥古尔图,奥贡布米,奥乔波德,奥克欣,奥卢贡纳,奥莫顿德,奥尼佩德,奥恩马,奥赫雷,奥里亚,奥图克旺,奥图纳德,兰帕,里米,鲁甘,鲁姆布卡瓦,萨比乌,桑加巴马,萨拉贝,塞博雷格托雷,沙法尔,沙格瓦,沙塔,申古,索科隆,苏纳尤,塔福基,塔库拉,塔隆坦,塔赫姆巴,塔尤,特尔,廷廷,廷亚姆,廷迪尔克,托昆博,托尔拉姆,特萨卡阿扎,特萨农戈,特塞比维,特塞帕格,图巴,图姆博,通加隆博,通加尼亚克维,乌克希里,乌莫鲁,乌穆阿拜,乌穆阿朱朱,恩奇达,翁瓜,翁古瓦尔,乌农戈,乌沙,乌通博,文贝拉,乌鲁,延巴希,延梅迪,尤库,扎伦克瓦里,齐卢莫,祖利卡",
      },
      {
        name: "凯尔特语",
        i: 22,
        min: 1,
        min: 10,
        d: "nld",
        m: 0,
        b: "阿贝拉曼,阿贝朗盖尔,阿贝阿思,阿贝阿冯,阿贝班克,阿贝巴戈德,阿贝比格,阿贝卡奈德,阿贝卡恩,阿贝卡斯特尔,阿贝塞吉尔,阿贝克拉夫,阿贝克雷根,阿贝奇赫,阿贝塞农,阿贝达尔,阿贝达龙,阿贝多格勒多,阿伯丁,阿贝杜莱斯,阿贝迪菲,阿贝德夫,阿贝瑞迪,阿贝雷赫,阿贝雷龙,阿贝范,阿贝弗劳,阿贝弗鲁德,阿贝加文尼,阿贝盖尔,阿贝格拉斯林,阿贝戈莱赫,阿贝格旺,阿贝格韦辛,阿贝格威利,阿贝格温菲,阿贝格温格雷金,阿贝金诺卢温,阿贝哈费斯普,阿贝洪杜,阿贝肯菲格,阿贝勒芬尼,阿贝曼,阿贝莫,阿贝莫杜,阿贝穆勒,阿贝南特,阿贝彭纳,阿贝波斯,阿贝里乌,阿贝索克,阿贝西坎,阿贝塔韦,阿贝泰菲,阿贝辛,阿贝提利,阿贝特里德沃,阿贝尔斯威斯,阿基宁弗,阿丰哈夫伦,阿利萨哈,安弗萨德,安廷贝尔马,阿登纳,阿塔孔,班温,贝拉,布鲁拉,布莱德法,博约杜罗,博纳,博斯基尼,博斯洛文波尔布罗格,布多布里加,布拉冯,布里甘特,布里甘塔,布里瓦,布罗斯纳赫,凯尔苏斯,坎博杜努姆,坎布拉,卡拉克塔,卡图马戈斯,森托布里加,塞雷迪吉翁,查莱恩,切尔瓦兰,克拉赛,科尔马克,库利阿纳赫,丁恩,迪瓦,杜宾根,杜维迪格,杜罗,埃博拉,埃布鲁阿克,埃布罗杜努姆,埃克勒斯,埃格洛斯库里,埃伊,艾伦,费尔库诺斯,弗拉斯宁,加尔布艾勒,热诺瓦,格兰斯,格威尔斯,哈茨西斯,希伯伦,霍尔德,因韦尔,因比尔,因比尔艾尔,因比尔艾尔恩,伊内尔莱森,伊内尔莱文,伊内尔威克,因弗,因弗阿尔迪,因弗阿兰,因弗阿尔蒙德,因弗阿姆赛,因弗安,因弗阿雷,因弗贝尔维,因弗克莱德,因弗埃尔,因弗埃斯克,因弗法里盖格,因弗加里,因弗戈登,因弗高瑞,因弗哈登,因弗凯洛尔,因弗凯辛,因弗凯辛尼,因弗基普,因弗雷,因弗莱斯,因弗洛赫,因弗洛赫拉里格,因弗洛奇,因弗梅,因弗莫里斯顿,因弗内斯,因弗奥兰,因弗申,因弗斯奈德,因弗特罗斯萨赫斯,因弗乌吉,因弗乌格拉斯,因弗乌里,尤布拉赫,卡拉尔德赫克,基尔宁弗,柯克卡尔迪,柯金蒂洛赫,克拉克,朗格罗,拉滕斯,莱明,林多马戈斯,兰阿贝尔,兰迪迪维格,兰蒂尔诺格,兰法尔辛,兰加德瓦尔德,兰桑维尔,洛钦弗,卢格杜诺,马戈杜罗,梅拉,蒙茅斯郡,南希里亚尔斯,纳兰,诺维奥杜诺,诺维约纳戈,奥克托杜龙,彭宁,菲奥法兰,庞斯梅尔,雷辛,里科马戈,罗斯因弗,萨洛杜鲁姆,塞吉亚,森蒂卡,特奥萨,托巴盖尔,特里阿劳,特雷费斯戈布,特雷韦登内克,特雷韦斯兰,图艾斯卡特,尤格,维托杜鲁姆,温多博纳",
      },
      {
        name: "阿卡德语",
        i: 23,
        min: 1,
        min: 10,
        d: "srpl",
        m: 0.1,
        b: "阿达布,亚当顿,阿德玛,阿德玛图姆,阿格拉布,阿卡德,阿克沙克,阿姆纳纳姆,安达里格,安山,阿皮鲁,阿普姆,阿兰图,阿尔比德,阿尔帕奇亚,阿尔帕德,阿拉法,阿什拉卡,亚述,阿万,巴比利姆,巴德-提比拉,巴拉瓦特,巴尔西普,比尔图,比特-布纳基,博尔西帕,楚埃拉,达什拉,德尔,迪尔巴特,迪尼克图姆,多拉,杜尔-库里加尔祖,杜尔-沙鲁金,杜尔-乌恩塔什,杜尔-古尔古里,埃布拉,埃卡拉特姆,埃卡尔特,埃马尔,埃尔比勒,埃雷什,埃里都,埃什农,埃什农纳,加尔加米什,加苏尔,加乌拉,吉比尔,吉尔苏,吉扎,哈比伦,哈布尔,哈达图,哈库兰,哈拉布,哈拉比特,哈马济,哈莫卡尔,哈拉杜姆,哈比杜姆,哈兰,哈拉努,哈苏纳,哈塔里卡,哈特拉,希萨尔,希亚瓦,霍尔米尔扎德,伊达-马拉斯,伊达马拉兹,伊杜,伊梅里舒,伊姆古尔-恩利尔,伊里萨格里格,伊尔尼纳,伊里杜,伊辛,伊辛尼图姆,伊图鲁伽尔,伊祖比图姆,贾尔莫,杰姆代特,卡布纳克,迦得什,卡哈特,卡尔胡,卡尔-舒尔马努-阿沙雷杜,卡尔-图库尔提-尼努尔塔,卡尔-舒尔马努-阿沙雷杜,卡拉纳,卡拉泰佩,卡尔图库尔提,卡扎卢,凯什,基德沙,金扎,基什,基西加,基苏拉,夸拉,库尔达,库鲁汉尼,库塔,拉加巴,拉加什,拉拉克,拉尔萨,莱兰,马尔吉乌姆,马拉德,马尔达曼,马里,马尔利克,马什坎,马什坎-沙皮尔,马图特姆,美-图兰,梅利杜,姆巴卡特,纳巴达,纳加尔,纳纳古加尔,奈雷布图姆,尼金,尼姆鲁德,尼娜,尼尼微,尼努阿,尼普尔,尼鲁,尼亚,努哈谢,努哈塞,努齐,普兹里什-达甘,卡拉特贾尔莫,卡塔拉,卡特纳,卡图南,基德舒,拉皮库姆,劳达,萨加兹,沙杜普姆,沙加拉图姆,沙尔巴图,沙尼达尔,沙鲁金,绍万,舍赫纳,舍赫纳,舍姆沙拉,希巴尼巴,舒巴特-恩利尔,舒尔库蒂尔,舒鲁帕克,舒沙拉,舒辛,西坎,西帕尔,西帕尔-阿姆纳纳姆,西帕尔-沙-安努尼图姆,苏巴图姆,苏苏卡,塔德莫尔,塔尔比苏,特卢尔,特尔卡,提拉齐什,蒂斯本,图巴,图沙恩,图图尔,图图布,乌贝德,乌玛,乌尔,乌拉,乌尔比鲁姆,乌尔凯什,乌尔萨乌姆,乌鲁克,乌鲁姆,乌扎尔卢卢,瓦尔卡,瓦舒卡尼,扎巴拉姆,扎里-阿姆纳纳姆",
      },
      {
        name: "波斯语",
        i: 24,
        min: 1,
        min: 10,
        d: "",
        m: 0.1,
        b: "阿巴利,阿布里沙姆,阿布萨尔德,阿布泽伊达巴德,阿弗斯,阿拉维切,阿利科什,阿莫尔,阿纳拉克,安巴尔,安迪谢,安山,阿兰,阿尔达比勒,阿尔德里卡,阿尔德斯坦,阿尔约曼德,阿斯加兰,阿斯加拉巴德,阿希安,阿万,巴巴詹,巴德鲁德,巴弗兰,巴格斯坦,巴格沙德,巴哈多兰,巴哈兰沙赫尔,巴哈雷斯坦,巴库恩,巴姆,巴盖尔沙赫尔,巴尔佐克,巴斯塔姆,贝希斯通,比蒂斯塔尔,布马亨,布什尔,查德甘,查哈尔当格,查姆加尔丹,切尔马欣,乔加布努特,楚甘,达马内,达马凡德,达拉卜加尔德,达兰,达斯特格尔德,德哈克,德哈坎,德兹富勒,迪齐切,多尔切,多拉特阿巴德,杜伦塔什,埃克巴塔纳,伊斯兰沙赫尔,埃斯塔赫尔,埃济耶,法拉瓦尔詹,法罗基,法沙姆,费尔多西耶,费雷敦沙赫尔,费鲁纳巴德,菲鲁兹库赫,富拉德沙赫尔,甘杰达雷,甘扎克,加兹,格约伊,戈丁,戈尔达什特,戈勒斯坦,戈尔佩甘,戈尔沙赫尔,戈尔山,戈尔加布,古格德,哈比巴巴德,哈夫谢詹,哈吉菲鲁兹,哈纳,哈兰德,哈桑阿巴德,哈桑鲁,哈什特格尔德,赫卡托姆皮洛斯,霍尔米尔扎德,伊曼沙赫尔,伊斯法罕,詹达克,贾瓦达巴德,吉罗夫特,乔什坎,乔兹丹,卡布纳克,卡赫里扎克,卡赫里兹桑格,康加瓦尔,卡拉杰,卡尔凯万德,卡尚,凯利沙德,克尔曼沙赫,哈利达巴德,汗萨尔,霍拉马巴德,胡尔,霍尔祖克,基兰,科梅,科梅什切,科纳尔,库佩耶,库尔,库什克,拉瓦桑,莱比德,利扬,利扬,马哈巴德,马哈尔拉特,马杰莱西,马拉尔德,曼扎里耶,马尔利克,梅什卡特,梅梅,米安达什特,米什,莫巴拉凯,纳哈万德,奈因,纳贾法巴德,纳克什,纳雷扎什,纳西姆沙赫尔,纳西尔沙赫尔,纳斯拉巴德,纳坦兹,奈亚萨尔,尼卡巴德,尼姆瓦尔,努沙巴德,帕克达什特,帕兰德,帕尔迪斯,帕尔萨,帕萨加代,帕蒂格拉巴纳,皮尔巴克兰,皮什瓦,卡赫德里詹,卡贾韦雷斯坦,卡姆萨尔,卡尔查克,科兹,拉巴特,雷-沙赫尔,雷兹万沙赫尔,拉格斯,罗巴特卡里姆,罗兹韦,鲁德亨,萨巴沙赫尔,萨法达什特,萨格齐,萨利耶,桑达尔,萨尔韦斯坦,塞德,塞菲德沙赫尔,塞米罗姆,塞姆南,沙德普拉巴德,沙阿,沙赫达德,沙赫德沙赫尔,沙欣,沙普尔,沙赫尔,沙赫雷扎,沙赫里亚尔,沙里法巴德,舍姆沙克,设拉子,舒山,舒斯塔尔,西亚尔克,辛,苏赫特,塔巴斯,大不里士,塔赫特,塔尔昆切,塔利,塔尔克,特穆坎,特佩,蒂兰,图德什克,图仁,乌尔米耶,瓦希迪耶,瓦赫尔卡纳,瓦纳克,瓦拉明,瓦尔南赫斯特,瓦尔扎内,瓦兹万,亚哈雅,亚里姆,亚苏杰,扎林沙赫尔,扎瓦雷,扎延德,扎泽兰,齐亚尔,齐巴沙赫尔,兹兰卡",
      },
      {
        name: "夏威夷语",
        i: 25,
        min: 1,
        max: 10,
        d: "auo",
        m: 1,
        b: "阿普埃奥,阿霍阿,阿胡阿凯奥,阿胡保,阿拉阿库阿,阿拉埃,阿拉埃洛阿,阿拉米希,阿莱阿迈,阿勒纳,阿里奥,阿乌波科波科,哈拉卡阿,哈雷乌,哈利伊迈勒,哈莫阿,哈纳考奥,哈瑙卢,哈纳瓦纳,哈内霍伊,哈欧,希基阿乌佩阿,霍库乌拉,霍诺希纳,霍诺卡胡阿,霍诺基亚纳,霍诺科豪,火奴鲁鲁,霍诺马埃勒,霍诺纳纳,霍诺波,霍拉瓦,胡埃洛,卡阿拉埃亚,卡阿帕胡,卡埃奥,卡哈勒希利,卡哈纳,卡胡艾,凯卢阿,凯内赫,卡卡拉哈莱,卡卡诺尼,卡勒纳努伊,卡莱奥艾赫,卡利亚利努伊,卡利希,卡利毛赫,卡洛伊,卡马尼,卡美哈美哈,卡纳赫纳,卡尼奥拉,卡奥诺乌鲁,卡帕洛阿,卡波胡埃,卡普艾基尼,卡普纳凯阿,考阿乌,考拉洛,考拉纳莫阿,考鲁奥哈纳,考乌马卡尼,考乌马努,考纳乌哈内,考帕库鲁阿,卡瓦洛阿,基阿阿,基阿乌拉,基哈乌阿波诺,基拉霍,基阿纳埃,基奥霍,凯拉维阿,基奥凯阿,基奥普卡,基库,基帕帕,科阿库普纳,科阿利,科洛科洛,科皮利,考乌,夸拉帕,库希瓦,库霍利利亚,库胡阿,库伊亚,库伊库伊,库科阿埃,库科希亚,库库伊阿埃奥,库库伊普卡,库库伊乌拉,库拉胡胡,拉帕基亚,拉普埃奥,劳尼乌波科,洛勒,马阿洛,马希纳希纳,迈莱帕伊,马卡基尼,马卡阿莱,马凯胡,马凯瓦,马卡皮皮,马卡普乌,马卢阿卡,马纳瓦伊努伊,梅哈梅努伊,莫阿利伊,莫阿努伊,莫霍皮利,莫凯,莫库伊亚,莫库帕帕,莫伊基,莫洛阿,莫穆库,穆奥莱阿,纳卡阿哈,纳卡莱波,纳卡欧胡,纳卡佩胡,纳库拉,纳皮利,尼尼奥,努乌,奥洛埃瓦,奥洛瓦卢,奥马奥皮奥,奥瑙,奥诺利,奥帕乌拉,奥帕纳,奥皮库拉,帕阿凯阿,帕埃阿胡,帕埃哈拉,帕埃奥希,帕霍阿,帕伊亚,帕卡基亚,帕劳埃阿,帕莱莫,帕尼亚乌,帕帕埃阿,帕帕阿努伊,帕帕阿乌哈乌,帕帕卡,帕帕乌卢阿纳,帕乌库,帕乌瑙,帕乌瓦卢,帕乌维拉,波哈卡内莱,波莱基,波拉努伊,波拉波拉,波波波,波波努伊,波普维拉,普阿霍瓦利,普阿凯阿,普阿科,普阿莱阿,普埃胡埃胡,普埃奥考伊基,普卡奥胡胡,普库伊卢阿,普莱胡,普奥鲁阿,普欧,普乌哈埃哈埃,普乌伊基,普乌基,普乌拉尼,普乌瑙,普乌奥迈勒,乌阿奥阿,乌豪,乌库梅哈梅,乌莱诺,乌卢马卢,瓦希库利,瓦亚内,瓦亚努,瓦亚瓦,瓦耶胡,瓦耶利,瓦伊卡普,瓦伊拉莫阿,瓦伊劳劳,瓦伊尼,瓦伊奥霍勒,瓦伊奥霍努,瓦伊奥胡利,瓦伊奥卡马,瓦伊奥基拉,瓦伊奥派,瓦伊奥普阿,瓦伊帕奥,瓦伊皮奥努伊,瓦伊普利",
      },
      {
        name: "卡纳达语",
        i: 26,
        min: 1,
        min: 10,
        d: "tnl",
        m: 0,
        b: "阿迪提帕特纳,阿迪亚尔,阿夫扎尔普尔,阿兰德,阿尔纳瓦尔,阿卢尔,安比卡纳加拉,阿内卡尔,安科拉,安尼格里,阿尔卡尔古德,阿尔西克雷,阿特尼,奥拉德,巴达米,巴加尔科特,巴格帕利,拜尔,巴杰佩,班加罗尔,班加拉佩特,班卡普拉,班努尔,班特瓦尔,巴萨瓦卡良,巴萨瓦纳,贝尔高姆,贝尔坦加迪,贝卢尔,巴德拉瓦蒂,巴尔基,巴特卡尔,比马拉亚纳古迪,比达尔,比贾普尔,比尔吉,比鲁尔,博马桑德拉,比亚德吉,查拉克雷,查马拉贾纳加尔,查纳吉里,查纳帕特纳,查纳拉亚帕特纳,奇克,奇克马加卢尔,奇克纳亚坎哈利,奇科迪,钦乔利,钦塔马尼,奇塔普尔,奇特戈帕,奇特拉杜尔加,丹德利,达尔加乔吉哈利,德瓦杜尔加,德瓦纳哈利,多德,多尼马莱,加达格,加杰德拉加尔,冈加瓦蒂,高里比达努尔,戈卡克,戈尼科帕尔,古比,古迪班达,古尔巴尔加,古莱德古达,冈德卢佩特,古尔马特卡尔,哈利亚尔,汉加尔,哈拉帕纳哈利,哈里哈尔,哈桑,哈蒂,哈维里,赫巴戈迪,赫加达德万科特,希雷凯鲁尔,霍拉尔凯雷,霍勒,霍姆纳巴德,霍纳瓦尔,霍纳利,霍维纳,霍萨科特,霍萨纳加拉,霍斯杜尔加,霍斯佩特,胡布利,胡凯里,洪贡德,洪苏尔,伊尔卡尔,因迪,贾加卢尔,贾姆坎迪,杰瓦尔吉,乔格,卡迪格纳哈利,卡杜尔,卡尔加特吉,卡马拉普拉姆,坎普利,卡纳卡普拉,卡尔卡尔,卡尔瓦尔,卡纳普尔,科迪亚尔,科拉尔,科尔格尔,科努尔,科帕,科帕尔,科拉塔格雷,科图鲁,克里希纳拉贾纳加尔,克里希纳拉贾萨加拉,克里希纳拉杰佩特,库德奇,库德利吉,库德雷穆克,库姆塔,昆达普拉,昆德戈尔,库尼加尔,库尔贡塔,库沙尔纳加尔,库什塔吉,拉克什梅什瓦尔,林苏古尔,隆达,马杜尔,马杜吉里,马迪凯里,马哈林古尔,马拉瓦利,马拉尔,马卢尔,曼迪亚,芒格洛尔,曼维,莫拉卡尔姆鲁,穆达尔吉,穆德比德里,穆德比哈尔,穆德加尔,穆德霍尔,穆迪格雷,穆尔巴加尔,穆尔贡德,穆尔基,穆卢尔,蒙达尔吉,蒙德戈德,穆尼拉巴德,迈索尔,纳加曼加拉,南贾纳古德,纳拉西马拉贾普拉,纳雷加尔,纳尔贡德,纳瓦尔贡德,尼帕尼,潘达瓦普拉,帕瓦加达,皮里亚帕特纳,普杜,普图尔,拉布卡维,赖丘尔,拉玛纳加拉姆,拉姆杜尔格,拉尼贝努尔,雷巴格,罗伯逊,朗,萨达尔吉,萨加尔,萨克莱什普尔,萨利格拉姆,桑杜尔,桑凯什瓦尔,桑达蒂,萨瓦努尔,塞达姆,沙哈巴德,沙普尔,沙克蒂纳加尔,希格高恩,希卡尔普尔,希尔哈蒂,索拉普尔,斯里朗加帕塔纳,西达普尔,西德拉加塔,辛迪吉,辛德努尔,西拉,西拉尔科帕,西尔西,西鲁古帕,索姆瓦尔佩特,索拉布,斯林格里,斯里尼瓦斯普尔,苏利亚,塔利科塔,塔里克雷,泰卡拉科特,特尔达尔,图姆贝,蒂普图尔,蒂尔塔哈利,蒂鲁马库达尔,图姆库尔,图鲁韦克雷,乌杜皮,维杰亚普拉,瓦迪,亚德吉尔,耶兰杜尔,耶尔巴加,耶拉普尔,耶纳古德",
      },
      {
        name: "克丘亚语",
        i: 27,
        min: 1,
        min: 10,
        d: "l",
        m: 0,
        b: "阿尔帕怀科,安奇瓦伊,安克亚,阿普里马克,阿雷基帕,阿塔瓦尔帕,阿塔瓦尔帕,阿蒂科,阿亚库乔,阿亚万科,艾尤,卡哈马卡,卡纳耶雷,坎查坎查,卡拉波,卡尔瓦克,卡尔瓦卡塔克,卡尚,考亚拉胡,卡哈马尔胡,卡哈瓦克,科帕约克,查查蓬塔,查克拉拉胡,查尔瓦马约,查姆帕拉,昌昌,切基阿克拉胡,奇里瓦,钦切伊,乔恩塔,乔皮卡尔基,楚库伊托,楚伊托,楚洛,丘姆皮,春乔,楚帕瓦乔,楚基阿波,楚基萨卡,楚鲁普,科卡帕塔,科查班巴,科胡普,科洛塔,科诺科查,科里瓦拉奇纳,库乔克塞拉,库西查卡,海卡,汉皮克,哈屯,哈瓦里斯卡,瓦卡,瓦钦加,瓦尔坎,瓦尔昌卡,瓦曼加,瓦马什拉胡,瓦卡尔瓦斯,瓦多伊,瓦努帕帕,瓦尔米瓦努斯卡,瓦斯卡兰,瓦伊拉斯,瓦伊拉班巴,瓦伊拉纳,瓦伊塔拉,维查汉卡,惠奈怀纳,惠恩切,惠尼奥奇,伊利亚斯卡,因蒂蓬库,伊基查,伊辛卡,哈瓦科查,吉里桑卡,胡里,卡纳卡南蓬塔,卡马斯卡,卡尔帕伊,考萨伊,库亚,库埃拉普,兰科查约克,拉卡,拉克塔帕塔,朗加努科,拉克塔,洛克拉斯卡,卢帕查约克,卢里科查,马丘,马尔库,马塔拉胡,梅切克,米库伊,米卢阿科查,莫罗楚科,穆奈,奥查帕尔卡,奥兰泰坦博,奥洛卡瓦,奥龙科伊,奥约洛,帕卡马约,帕卡伊卡萨,帕查拉胡,帕查卡马克,帕查卡马克,帕查库特克,帕查库提,帕查玛玛,帕伊蒂蒂,帕哈藤,帕尔卡拉胡,帕尔卡斯,潘帕,帕纳卡,帕卡里纳,帕科,帕拉普,帕里亚,帕塔瓦西,帕塔拉克塔,帕蒂班巴,皮萨克,皮斯科,蓬戈斯,普卡科尔帕,普卡希尔卡,普卡兰拉,普马坦博,普斯坎图尔帕,普塔卡,普尤帕塔马克,卡瓦克,卡伊卡,科查莫科,科拉纳,科里瓦拉奇纳,科里莫科,科图普基奥,克努阿拉克拉,克什克,基什克,基塔尔卡伊万卡,基利亚,基塔拉克萨,库斯库,拉胡科尔塔,拉胡塔纳坎,拉胡图纳,兰拉希尔卡,兰拉帕尔卡,拉里亚,拉萨克,里马里马,里奥班巴,伦库拉凯,鲁雷克,萨克萨,萨克萨马尔卡,萨伊瓦,萨拉波,萨亚克马尔卡,萨伊里帕塔,西纳卡拉,松科帕,塔里帕伊帕查,陶利拉胡,陶安廷苏尤,泰坦奇斯,提瓦纳库,托克拉拉胡,萨克拉,图科,图库班巴,图尔帕拉胡,图姆贝斯,乌楚拉凯,乌楚拉凯,乌尔塔,乌里瓦胡阿纳,乌鲁阿什拉胡,瓦鲁纳拉胡,维尔卡班巴,瓦乔,旺卡威尔卡,瓦伊拉,亚查伊,亚华拉胡,亚那马雷,亚那库查,亚内沙,耶鲁帕哈",
      },
      {
        name: "斯瓦希里语",
        i: 28,
        min: 1,
        min: 10,
        d: "",
        m: 0,
        b: "阿比姆,阿朱马尼,阿勒比通,阿莫拉塔尔,阿穆鲁,阿帕克,阿鲁阿,阿鲁沙,巴巴蒂,巴拉戈伊,邦博,布达卡,布盖姆贝,布吉里,布伊克韦,布凯迪亚,布科巴,布科曼西比,布昆古,布利萨,布迪布约戈,布贡加,布塞姆巴蒂亚,布申伊,布西亚,布索尔韦,布塔莱贾,布坦巴拉,布特雷,布温格,布延德,达达布,多多马,多科洛,埃尔多雷特,埃勒古,埃马利,恩布,恩特贝,加里萨,盖德,古卢,汉德尼,希马,霍伊马,霍拉,伊班达,伊甘加,伊林加,伊辛吉罗,伊西奥洛,金贾,卡邦,卡布延达,卡布沃赫,卡加迪,卡贾多,卡金加,卡基里,卡库马,卡朗加拉,卡利罗,卡隆戈,卡隆古,坎帕拉,卡姆温格,卡努古,卡普乔尔瓦,卡塞塞,卡苏鲁,卡塔克维,卡永加,凯罗卡,基安布,基巴莱,基巴哈,基宾戈,基布韦齐,基戈马,基希希,基利菲,基鲁胡拉,基里扬东戈,基西,基索罗,基苏姆,基塔勒,基特古姆,基图伊,科博科,科罗格韦,科蒂多,库米,卡亚赞加,凯杰格瓦,凯恩乔乔,基奥特拉,拉穆,朗加塔,林迪,洛德瓦尔,洛基乔吉奥,隆迪亚尼,洛扬加拉尼,卢加兹,卢卡亚,卢韦罗,卢瓦卡哈,卢温戈,利安通德,马查科斯,马芬加,马坎巴科,马金杜,马拉巴,马林达,马纳夫瓦,曼德拉,马尔萨比特,马萨卡,马辛迪,马苏利塔,马图加,马尤格,姆巴莱,姆巴拉拉,姆贝亚,梅鲁,米托马,米蒂亚纳,蒙巴萨,莫罗戈罗,莫罗托,莫亚莱,莫约,姆潘达,姆皮吉,姆庞德韦,姆特瓦拉,穆本德,穆科诺,穆兰加,穆索马,穆托莫,穆图库拉,姆万扎,纳贡盖拉,内罗毕,奈瓦沙,纳卡皮里皮里特,纳卡塞克,纳卡松戈拉,纳库鲁,纳芒加,纳马因戈,纳穆图姆巴,南萨纳,南尤基,纳罗克,纳罗莫鲁,内比,恩戈拉,恩杰鲁,恩乔姆贝,恩科孔杰鲁,恩通加莫,尼亚胡鲁鲁,尼耶里,奥亚姆,帕德尔,帕依达,帕夸奇,帕利萨,拉卡伊,鲁伊鲁,鲁昆吉里,鲁伊米,桑加,森巴布勒,希莫尼,希宁加,辛吉达,西龙科,松加,索恩加,索罗蒂,萨萨加博,松巴旺加,塔博拉,塔考恩古,唐加,提卡,托罗罗,图恩杜马,维希加,沃伊,瓦吉尔,瓦基索,瓦塔穆,韦布耶,沃布伦齐,沃特,温达尼,云贝,赞比亚尔",
      },
      {
        name: "越南语",
        i: 29,
        min: 1,
        min: 10,
        d: "",
        m: 1,
        b: "安江,英山,安凯,安暖,爱云坡,北江,北干,北辽,北宁,巴顿,保禄,巴地,巴地‑化柔,巴托克,宾甲,槟椥,边和,宾山,平定,平阳,平隆,平明,平福,波恩和,邦马托,槟来,嘉冒,金磕,金坡,金兰,金水,芹苴,高平,高荣,高峰,昭牟,芝岭,孔琼,化洛,大北,得乐,大叻,岘港,永隆,永安,永诚,乂安,陈富,福主,富禄,富寿,广宁,光荣,岸三,安沛,化臻,化尼,光州,金杯,京门,广南,启安,启山,乐山,乐水,劳义,莱州,岚𡎹,浪强,谅山,老街,隆安,隆庆,隆美,龙泉,梁山,麦州,蒙岐,木勇拉特,木勇莱,美孝,美拖,南禅,南定,芽湾,芽南,芽山,义安,义洛,宜陆,宜山,桂峰,归州,归合,青留,贵安,格芽,沙德,西贡,三山,沙坝,朔庄,松口,松公,山罗,山西,三碟,三圻,新安,新州,新溪,新乐,新山,新渊,西宁,砾城,太平,台和,太原,清昌,清化,少化,顺安,顺化‑顺化,首都一,守德,上春,前江,庄邦,茶荣,朝山,𤆬山,宣光,蕪和,翁庇,越池,荣,荣州,荣禄,荣龙,荣渊,渭亭,化柔,安定,安清,安水",
      },
      {
        name: "粤语",
        i: 30,
        min: 1,
        min: 10,
        d: "",
        m: 0,
        b: "柴湾,清涌,清河,清新,清盛,潮南,潮安,秋阳,志远,彩洪,朱海,瑞文,仲夫,中山,中国村,达兴,大埔,大门,定武,田北,东郡,东园,屯洲,花洲,粉岭,发公,佛山,火炭,福建,富门,奉公,丰海,丰盛,丰泰,锦田,高洲,高明,江海,江成,戈摇,坑口,坑尾,恒安,香洲,香港,香桥,兴宁,何福堂,海趣,海丰,开平,河口,鹤山,河源,红磡,洪水桥,九岭,锦尚,锦湾,九龙塘,基隆,健安,建生,杰扬,江门,谷公,葵芳,葵兴,广洲,广岭,广明,观塘,荔枝角,荔景,荔湾,林泰,蓝田,梨洞,良景,廉江,连平,连山,罗定,乐昌,乐富,龙村,龙公,龙门,龙平,龙华,龙武,罗湖,卢洲,陆丰,陆河,龙门,马长,流溪水,马鞍山,茂明,茂南,美孚,明锦,茅公,旺角,梅洲,梅公,梅园,泥围,南昌,南海,南康,南沙,雁围,牛头角,吴村,吴华,安定,北湾,菩提山,平山,平园,博寮,庞安,波宁,波头,埔头,西湾河,西营盘,三圣,三水,三秦,三元里,新峰,新兴,三汇,新围,西围,深水埗,山尾,山洲,韶关,石门,石排,上水,成奎,肇兴,顺达,顺义,树本围,先成,小喜,小洪,小官,小轮,穗溪,大平,太古,大埔,大水坑,大围,太和墟,天后,天水围,调景岭,台山,塘坊,塘流湾,茶果岭,曾江,曾成,将军澳,尖沙咀,青公,青山村,青云,青衣,青园,潮州,荃湾,屯门,东涌,围仔,围洲,围东,围里,围城,围阳,湾仔,湾阜,湾成,永安,黄圃,黄大仙,和平,乌溪沙,亚诺,油麻地,油塘,仁发,杨村,杨东,杨西,阳山,盐田,英德,耀平,永成,永园,元朗,元成,月秀,郁南,云平",
      },
      {
        name: "蒙古语",
        i: 31,
        min: 1,
        min: 10,
        d: "aou",
        m: 0.3,
        b: "阿达茨格,艾拉格,阿勒坦额尔德尼,阿尔泰,阿尔坦希尔吉,阿尔坦措格茨,阿尔布拉格,巴察干,巴特诺罗夫,巴特希尔吉特,巴特曾格,巴彦阿达格,巴彦阿格特,巴彦布拉格,巴彦敦代,巴彦敦,巴彦戈壁,巴彦哲尔格朗,巴彦洪戈尔,巴彦呼塔格,巴彦利格,巴彦蒙赫,巴彦努尔,巴彦翁多尔,巴彦乌沃,巴彦塔尔,巴彦策根,巴彦图门,巴彦乌拉,巴彦祖尔赫,贝尔赫,比格尔,宾德尔,博格德,博姆博格尔,博尔翁多尔,布格特,布尔干,布尔格汗盖,布尔恩托克托赫,布特萨根,布扬特,昌德曼尼,昌德曼尼翁多尔,乔贝尔桑,楚伦呼鲁特,楚鲁特,达达尔,达兰哲尔格朗,达兰扎格达,达尔汉穆明甘,达尔汗,达尔维,达什巴尔巴尔,达辛奇伦,德尔格尔,德尔格雷赫,德尔格汗,德尔格汗盖,德尔格措格特,德鲁恩,德伦,多尔贡,杜特,额尔登,额尔登布尔干,额尔登布伦,额尔登达莱,额尔登曼达尔,额尔登措格特,格尔沙尔,嘎尔特,加卢特,戈壁乌格陶,古尔万,古尔万布拉格,古尔瓦赛汗,古尔万扎格,兴安,霍东,霍林格尔,洪德伦,霍林格,科尔沁,呼伦贝尔,胡热,伊赫赫特,伊赫塔米尔,伊赫乌拉,哲尔格朗,哲尔格特,哲尔格特汗,贾鲁德,金斯,哈伊尔汗,哈尔戈尔,哈利恩,汗博格德,汗盖,汗格尔,汗赫,汗洪戈尔,哈沙特,哈坦布尔格,哈特格尔,克尔伦,希西格翁多尔,霍赫,霍隆布尔,洪戈尔,霍通特,霍夫德,霍夫斯格尔,呼尔德,呼尔梅马尔,呼尔门,呼塔格翁多尔,卢斯,曼达赫,曼达尔乌沃,曼汗,曼赖,马塔德,莫戈德,蒙克海尔汗,莫龙,默斯特,明格德,诺戈恩努尔,诺姆贡,诺罗夫林,诺永,奥吉,奥尔吉,奥尔宗,翁多尔汗,翁多尔希尔,翁多尔乌兰,翁尼乌德,鄂尔多斯,奥尔贡,鄂尔浑,拉沙恩特,仁钦鲁姆贝,萨格赛,赛汗,赛汗杜拉安,赛汗乌沃,赛因尚德,赛因特萨根,色楞格,塞尔格伦,塞夫雷,沙尔加,沙林格尔,舍恩伊德尔,舍恩金斯,希维戈壁,苏姆贝,泰希尔,塔里亚兰,塔里亚特,特希格,托格罗格,托格托赫,托尔博,托莫布尔格,通希尔,托松特森格尔,察干德尔格尔,察干努尔,察干乌沃,察干乌尔,察希尔,采尔,曾格,策策尔格,措格特,措格特乌沃,措格特策齐,图梅德,图内尔,图夫施鲁勒赫,乌兰巴德拉赫,乌兰呼斯,乌兰乌拉,乌兰海德,乌兰察布,乌延奇,耶松布尔格,扎格,扎兰努尔,扎木因乌德,泽雷格",
      },
      {
        name: "人类通用语",
        i: 32,
        min: 1,
        min: 10,
        d: "peolst",
        m: 0,
        b: "琥珀谷,天使之手,箭谷,秋环,秋堡,盆地霜冻,盆地摩尔,海湾霜冻,熊卫,熊沼,钟石冢,钟港,钟域,黑卫,萧瑟守卫,骨口,巨石,桥瀑布,桥森林,盐峰,脆盔,铜握,城堡十字,城堡集市,洞穴沼泽,克莱蒙德,泥口,净卫,悬崖门,悬崖裂,悬崖盾,云湾,云顶,云木林,寒堡,岩丘,鸦林,鸦窖,水晶岩,水晶尖塔,诅咒之地,诅咒守卫,诅咒咒语,黎明森林,黎明之水,亡港,亡堡,深石冢,鹿寒,恶魔陨落,露谷,露湖,枯谷,枯谷,土盾,犬海岸,犬草地,龙裂,龙堡,龙卫,干堡,尘十字,尘卫,鹰脉,大地之野,地门,地径,乌前线,崖港,长老门,长老湖,余烬窖,永寒,永海岸,虚谷,仙池,仙谷,仙院,惧峰,火焰守卫,火焰井,弗蕾壳,鬼谷,鬼峰,幽暗燃烧,金裂,金院,草原,灰哨,绿野,污垢林,污垢郡,心碎,心港,心窖,高地出生,山道,空暴,蜜水,猎犬呼唤,猎犬堡,冰堡,冰光,铁墓,铁穴,骑士之光,骑士潮汐,环礁湖径,湖十字,末湖,末星,光谷,酸橙环,小厅,小堡,小沼,失石冢,失盾,失星,疯集市,疯汉,中堡,勇谷,磨坊岸,雾窖,月径,月亩,月湾,月井,苔手,苔潮,苔风,泥港,泥镇,神话峡谷,神话裂,永顶,永前线,新瀑布,夜厅,橡钟,橡溪,海星,旧域,旧墙,旧卫,牛溪,牛光,珍珠港,松池,池瀑布,池镇,净壳,快钟,快径,鸦侧,恶棍港,玫瑰诞生,玫瑰谷,玫瑰域,锈摩尔,盐口,沙丘,焦哨,焦厩,暗影森林,暗影草地,暗影镇,微光溪,微光林,裹尸布岩,静堡,银石冢,银峡谷,小沼,平滑悬崖,平滑林,平滑镇,蛇湖,雪湾,雪盾,雪镇,南裂,春沼,春景,鹿港,蒸汽口,蒸汽墙,陡坡摩尔,静厅,石卫,石咒,风暴之手,风暴角,日湾,日厅,沼泽之口,天鹅卫,天鹅墙,快井,荆棘石冢,荆棘盔,荆棘院,木材侧,贸易镇,西草地,西点,白岸,白谷,野伊甸,野井,野院,冬港,狼径",
      },
      {
        name: "精灵语",
        i: 33,
        min: 1,
        min: 10,
        d: "lenmsrg",
        m: 0,
        b: "阿德里德斯,艾塞尔,阿弗兰瑟玛,艾夸,阿拉瑞,阿兰纳,阿尔马利安,阿洛拉,阿利亚娜萨瑞,阿丽埃洛娜,阿丽兰,安玛,安因戴尔,阿拉萨瑞,阿伦,阿什梅贝尔,艾姆卢姆,贝尔-迪戴尔,布林诺里昂,凯洛拉,乔尔萨德,昌德拉,西梅尔,赛朗,多拉里斯,多伦德,德雷思,德兰赞,德劳加斯特,伊安娜,埃希尔,埃希尔,埃贝尔,埃弗兰卢玛,埃尔德-辛诺克林,埃勒瑟尔,埃拉纳林,埃琳娜,埃洛松德,埃尔泰西,埃卢诺尔,埃米兰瑟林,恩西娅斯,埃里亚冈德,埃萨瑞,埃萨斯,埃瑟留斯,埃什萨林,埃什塔拉斯,埃夫拉兰德,法埃伦诺,法梅伦诺拉,菲尔兰利恩,菲尔萨夸,加菲西娅斯,加夫·瑟林,盖琳,冈多温,瓜卢,海思,汉卢娜,豪尔萨德,赫洛里亚斯,希姆拉瑞恩,希姆利恩,欣尼德,赫利纳斯,赫洛伊琳尼尔,赫卢伊黑,赫卢尔塞伊,赫琳尼德,伊埃纳里昂,伊伦,伊拉纳泰斯,伊尔法诺拉,伊姆拉隆,伊米斯,伊米维利安,因费留斯,因卢斯,因斯谢,伊拉尔瑟林,伊雷思塔洛斯,伊尔霍洛娜,伊沙尔,伊什拉莎拉,伊塞里昂,伊特林,尤利尔,贾尔,贾姆卡迪,卡卢姆,卡安瑟拉,卡兰萨尼尔,卡诺西亚,卡塞瑟尔,基西娅斯,凯尔西亚,凯斯·艾夸,克姆隆,基亚瑟勒诺,基亚瑟拉,拉埃西娅斯,莱夫多雷,莱勒哈梅尔,莉莲,林迪尼尔,林多雷斯,利蒂斯,拉乌盖,莉娅,莉法,莉尔哈里昂,莉娜塔拉斯,马切伊,马瑟诺里斯,马瑟希尔,马森西娅斯,米塔拉斯,梅尼亚玛,米斯洛恩德,米莎,米斯瑟梅尔,米斯萨斯,纳奥霍纳,纳洛尔,南迪迪尔,纳萨德·伊劳斯,纳辛,纳瑟玛,尼达尔,尼尔隆,内拉隆,内莉安,内尔内泰西,尼莱纳瑟尔,尼昂安德,尼尔姆,尼泰纳纳斯,尼森勒诺,奥安勒诺拉,奥贝斯,奥法恩瑟尔,奥尔姆奈斯,奥尔姆斯梅尔,奥尔温,奥利安纳斯,奥马纳隆,奥涅里昂,奥涅隆德,奥洛尔梅尔,奥姆里昂,奥莎娜,奥什瓦梅尔,雷塞伊,劳瓜尔,雷瑟拉,雷斯勒诺拉,瑞安瑟拉,莱玛瑟林,萨诺,萨瑟卢恩,塞尔-泽德拉津,塞拉纳诺,塞勒里昂,塞尔马卢玛,沙拉斯,谢姆纳斯,谢姆瑟林,谢奥萨瑞,西勒塔洛斯,西瑞安德,西瑞亚希尔,斯兰诺,沙恩瑟尔,沙乌卢,赛霍卢姆,西尔哈留斯,西尔兰贝尔,泰西,萨洛尔,萨伦隆,塞勒思卢恩,塞尔霍希尔,塞玛,塞恩,希尔法利安,希尔奈诺,思维塔拉斯,塞尔斯拉隆德,蒂雷古尔,特劳恩,特林德,乌拉尔,乌尔夫,乌尔梅西娅斯,乌尔辛,乌姆纳林,乌米耶,乌米黑瑟林,乌南纳斯,乌纳里斯,温德雷斯,尤尼萨里昂,维尔-肖尼多尔,维纳斯,文·阿戈尔,瓦斯里昂,乌拉利安,耶卢玛,耶卢姆,耶思里昂,伊姆瑟林,尤厄格德,尤兰,尤思丁",
      },
      {
        name: "黑暗精灵语",
        i: 34,
        min: 1,
        min: 10,
        d: "nrslamg",
        m: 0.2,
        b: "阿贝萨加,阿布思,阿弗兰瑟玛,阿哈拉分裂,艾达纳特,奥尔德伦,阿沙曼努,阿什萨瑞,阿什莱西娅斯,拜拉里奥,拜雷格尔,拜西,巴哈莎,巴尔莫拉,贝尔-迪戴尔,博雷萨尼尔,布伊尔兰丁,凯尔拉吉斯,凯尔拉萨拉,凯尔格罗思,卡尔德拉斯,查加,查加斯特,钱塔尔,查尔夫海尔-劳加斯特,乔尔辛,昌德拉,切德纳萨德,切塔尔·伊斯林,切斯·里尔欣,奇迈尔,克拉克隆德,克洛伊布拉,科摩拉格,赛朗格罗思,希尔本,戴尔达,戴德罗格,达尔金,杜尔登,多伦德雷斯,多拉里斯,多伦德,德雷思,德兰赞,德兰齐尔,德劳加斯特,德雷格黑,德雷尔黑,德林德鲁,达斯克林,戴恩·吉恩尼瓦尔兹,埃德拉西昂,埃尔德-辛诺克林,埃洛松德,恩赫瑟尔,恩西娅斯,埃拉尔·伊斯林,埃林德林,法拉戴尔,法内达尔,费塔拉斯,菲尔兰利恩,福尔马里昂,费多,加菲西娅斯,格隆德,吉尔拉尼尔,格拉莫迪斯,格纳尔莫克,格尼西斯,戈洛塞尔,冈多温,瓜利杜斯,瓜卢,古尔辛,海思,哈格拉夫,哈根内斯,哈卡尔德拉,豪尔萨德,豪恩德拉思,赫洛里亚斯,赫拉姆查尔,拉乌盖,赫洛伊琳尼尔,赫卢伊塔尔,因费留斯,因斯谢,伊瑟拉乌吉姆,伊扎伊奥吉斯,贾尔,贾查尔克欣,凯尔阿布雷,卡兰萨尼尔,卡隆卡,卡尔索卢斯伊尔,凯利思,库乌尔,拉埃西娅斯,利杜斯,林迪尼尔,利里拉奎恩,利斯·迈阿瑟,卢斯·德里尔,洛丝,洛苏伊尔,卢伊豪伦塔尔,玛拉琳,玛瑞米德拉,马萨斯洛纳,马瑟希尔,梅洛多纳,梅纳吉斯,梅内格温,梅内伦迪尔,门齐尔,门佐伯兰赞,米拉-尼帕尔,米思林,莫拉格玛,蒙多,米瓦纳斯,纳加隆德,南迪迪尔,纳萨德·伊劳斯,诺瑟,纳维萨斯,尼达尔,努尔塔莉薇,尼迪尔,诺伊本,奥尔温,奥拉洛娜,奥贝斯,奥法恩瑟尔,奥洛尔梅尔,奥利特拉,佩拉吉亚德,雷塞伊,劳加斯特,劳瓜尔,里劳文,里尔哈夫黑,萨德里思,塞尔-泽德拉津,赛达宁,沙兹里尔,斯卡尔,斯钦迪林,沙马斯,沙门兹,尚图尔,沙恩廷兰,沙恩瑟尔,绍尔辛,斯斯·莫凯恩,斯斯林,斯佐拜斯,瑟德姆本,特林德黑,泰布佐尔,特尔梅尔,特尔纳奎尔,萨拉拉斯,蒂拉斯隆德,特劳盖,特里泽克斯,泰瑞布林,乌高思,乌吉姆,乌海尔本,乌尔马塔洛斯,乌尔梅西娅斯,乌尔伦瑟林,乌鲁伊图尔,温德雷斯,温德劳斯,温德雷克索斯,昂格萨尔,乌斯·纳萨,乌萨西恩,维尔德林沙尔,瓦贾,维尔-肖尼多尔,维尔德拉,维洛斯,维内德,瓦尔萨瓦,文纳戈斯,沃贾,瓦埃塞,瓦埃塞,沙尔基斯,亚卡利丹,耶卢姆,伊尔德里本,尤思丁,尤思丁林,齐尔纳凯宁",
      },
      {
        name: "兽人语",
        i: 37,
        min: 1,
        min: 10,
        d: "gzrcu",
        m: 0,
        b: "阿德戈兹,阿德吉尔-加,阿多格,阿兹尔德,阿格卡德,阿兹伊尔-加尔,阿克,阿里兹-德鲁,阿尔库格佐,阿罗德里,阿什内德,阿兹尔德雷赫,巴吉尔德雷,巴什努德,贝吉兹-格拉兹,巴赫,贝格,比克佐杜尔,比克鲁尔,比尔戈什贝尔,博格,布尔克鲁赫,博德-鲁格尼兹,博泽尔,博兹德拉,博兹格伦,博兹兹,布拉尔-拉佐格,布拉扎德,布罗格韦德,布罗格佐齐尔,布罗尔祖格,布罗德格,布罗克里尔-兹罗格,布鲁格罗兹,布鲁赫-兹拉布鲁尔,布鲁尔-科雷,布尔布雷德,布尔格拉格,查兹-查拉德,切根-凯德,楚加,楚扎尔,达尔格伦-莫格,达宗-内尔,德扎,多杜德,多德-布雷德罗德,多德-吉金,多贡-博格,杜尔巴佐尔,迪格扎基格,迪尔德鲁德,多德卡克,多格里,德里兹德德,德罗巴格,德罗德-阿什努格,德罗格武赫-德罗德,德鲁赫-科德戈兹,德鲁尔库兹,杜杜德,杜尔-哈多,埃格莫德,埃赫-贝肯,埃赫-克雷德鲁格,埃赫-梅兹雷德,加格-德鲁兹雷德,加兹德拉赫-弗拉德,格格诺德,格尔克拉德,加格罗克罗兹,加雷德-克林,盖奇格罗布罗尔,盖格戈尔,吉兹吉尔,戈-乌格努德,戈尔加德,吉德-乌切格,戈克科格穆尔德,戈尔孔,格拉兹-胡尔加格,格里布拉布罗克,格里德科格,格里格-卡加兹,格里克伦-库尔,格鲁霍克,格鲁罗,古格-佐兹格罗德,古尔-戈格卡格,伊巴格-乔尔,伊布鲁泽德,伊布尔-布拉德,伊古尔扎兹,伊赫-乌格南,伊尔德里祖格,伊尔梅赫-博尔,卡克鲁兹,卡尔布鲁格,卡尔科尔-兹里德,卡祖兹-兹拉尔,凯祖尔-布鲁兹,哈基兹,赫本,霍尔布里克,胡尔德雷拉,胡兹德拉兹,基尔戈尔,科戈德,科尔基尔-格拉尔,克拉吉尔德,克拉尔-祖尔穆尔德,克里格-布赫丁,克罗达德,克鲁德-霍格佐克,库德格罗库克,库德鲁赫,库德扎尔,库兹格鲁德-德德,拉鲁德,莱格维克罗德,洛格兰,卢格赫,卢尔科尔,马兹加尔,默克拉兹,莫克库尔德雷,莫德-奥多德,莫布拉兹,穆布罗尔,穆克库格-古兹,穆加赫-奇尔,穆尔马德,纳扎德-路德,内格维德,内尔佐-兹罗兹,尼尔德鲁赫,诺格沃尔卡,努布德,努卡格,努德-库德拉,努泽克罗,奥迪格-克罗德,奥赫-乌格克,奥多尔,奥库德-布尔,奥拉德,卡什纳格,奇卡德-沙尔,奇多佐格,奇佐多卡克,奇尔佐德,拉鲁德,雷拉格利,雷泽格,雷兹格鲁格,罗德雷赫,罗格-奇尔扎兹,罗德鲁什诺克,罗泽兹,鲁迪尔格拉德,鲁尔古兹-维格,鲁兹格林,乌格-弗鲁伦,乌格达德,乌尔德鲁赫-布德,乌尔戈尔,乌尔金,乌姆格-埃赫,乌扎戈尔,乌兹德里博兹,乌兹德罗兹,乌佐德,乌兹龙,瓦多格,瓦戈德-霍德,维尔格鲁德,维鲁格,弗拉津,弗罗布鲁恩,弗鲁格-纳德雷尔,弗鲁古,武克西德,武恩-加古赫,扎克拉德,扎尔布雷兹,齐格莫布雷德,佐尔德鲁杜德,佐鲁德,兹拉德古赫,兹拉格穆赫,兹拉格里兹格拉赫,兹拉尔德-克罗多格,兹拉祖兹-瓦兹,兹里古德,兹鲁尔布赫-德克,祖博德-乌尔,祖尔布里兹,祖恩-伯格罗德",
      },
      {
        name: "矮人语",
        i: 35,
        min: 1,
        min: 10,
        d: "dk",
        m: 0,
        b: "阿杜恩达,阿哈格扎德,阿哈齐尔,阿基尔,阿克齐扎德,阿努穆什,阿拉杜什,阿拉尔,阿尔布尔,巴杜顺德,巴拉格齐格,巴拉格宗德,巴拉金布,巴拉克齐格,巴拉克津布,巴拉克齐尔,巴拉蒙兹,巴拉津布,巴拉齐尔,比尔加巴,比尔加萨布,比尔加扎兹,比尔吉拉,比尔纳拉格兹,比尔努尔巴,比尔努尔本,比扎杜姆,比扎杜什,比扎纳格,比扎拉姆,比津比兹,比兹拉姆,本阿拉姆,本迪纳尔,本杜绍尔,本杜顺德,本杜舒尔,布扎拉姆,布宗达布,布宗杜什,加巴拉格兹,加巴拉姆,加比尔加布,加比尔加思,加比齐尔,加布纳尔,加布努尔,加布赞,加萨拉姆,加萨布赫尔,加齐兹杜姆,加图拉格兹,加图拉兹,吉拉,吉莱德齐尔,吉卢克哈斯,吉卢克赫尔,古纳拉,古纳加思,古纳吉尔,贡杜蒙兹,贡杜萨布,贡杜希兹德,卡尔布哈比尔恩,卡尔布哈萨布,卡尔布赫拉,卡尔比加布,卡尔布扎德,卡萨尔巴,卡齐兹丁,卡宗杜什,卡扎纳尔,卡津本德,卡齐拉格兹,卡齐拉兹,卡兹达本,卡兹杜萨布,卡兹杜萨斯,卡兹杜谢尔,卡兹杜舒尔,科莱德扎尔,昆达比尔恩,昆达布兹,昆达纳格,昆杜谢尔,库拉格齐格,库拉蒙兹,基巴拉克,基比尔纳尔,基比扎尔,基本纳格,基本丁,基布赞,金巴达布,金巴拉格兹,金巴拉克兹,金巴拉姆,金比扎,金布扎尔,纳拉,纳莱德扎尔,纳莱德齐格,纳莱德津布,纳拉格扎,纳拉格扎尔,纳拉格齐格,纳拉克扎,纳拉克扎尔,纳拉蒙兹,纳拉扎尔,纳加巴达,纳加巴,纳加萨布,纳吉拉,纳贡杜姆,纳贡杜什,纳古努尔,纳鲁克萨尔,纳鲁克塞尔,努拉,努尔巴杜什,努尔巴拉姆,努尔比尔纳格,努尔布纳尔,努尔本达布,努尔本丁,努尔本杜姆,努尔布扎,努莱德扎,努莱德齐格,努卢克哈兹,努卢克昆德,努卢克赫尔,沙拉金布,沙拉克扎尔,沙拉蒙兹,沙尔巴鲁克萨尔,沙萨布希兹德,沙萨布比兹,沙萨扎,沙齐兹杜什,沙托拉,沙齐拉格兹,希兹迪纳尔,希兹杜顺德,绍卢克哈尔布,顺迪努尔布,顺杜顺德,舒拉格宗德,舒拉蒙兹,沙金巴达布,沙金巴拉格兹,沙金巴拉克兹,沙金巴拉姆,沙金比扎,沙金布扎尔",
      },
      {
        name: "哥布林语",
        i: 36,
        min: 1,
        min: 10,
        d: "eag",
        m: 0,
        b: "阿辛克斯,比亚吉尔特,比奥克维什,布利克斯,布卢斯,布拉特利亚克,布雷沙斯,布里德维尔布,布里布西尔,布格比格,布亚格,塞尔,乔克,基亚夫齐亚,乔克斯,希尔布,科斯维尔,克雷科尔克,克里尔德,克罗比克,迪尔瓦克,多布宁,德里奥德,埃布利格兹,伊恩,埃尼西,埃斯兹,法尔,费尔霍布,弗罗希奥夫兹,弗鲁伊克特,菲格西,加加布林,吉甘奇,吉夫齐克,格拉姆佐夫斯,格尔纳阿克斯,格尼布斯,格诺克利格,戈布达科,戈布科克,戈布布林,赫萨伊,希齐尔斯,霍布加尔,洪克,伊哈扎尔姆,伊阿尔西尔特,伊尔姆,伊什,贾谢夫塔,乔伊姆托伊尔姆,卡斯,卡特梅尔特,克莱布通,克莱德克,克利姆,克卢伊尔姆,库伊普因克斯,莫夫特,莫格,尼尔博格,奥伊姆佐沙伊,昂克,奥兹比亚德,帕斯,法克斯,菲格海尔代,普雷昂,普罗克,派雷齐,克尔拉格斯,科斯克斯,雷克斯,沙克西,西奥斯,斯莱赫兹特,斯洛夫博伊夫,斯卢克克斯,斯雷夫斯,斯鲁尔德,斯蒂加尔蒂亚,斯蒂奥尔克斯,斯蒂奥斯库尔特,斯特罗伊尔,斯特里扎克特,斯图伊克瓦克特,斯特尔赞盖,苏伊尔克斯,斯瓦克西,塔克斯艾,塞尔特,思雷西亚,瑟尔特,特拉格利拉,特雷亚克,乌尔布,乌尔姆,乌萨,乌蒂阿尔姆,维克兹,沃尼奥茨,弗雷加尔德,瓦特维尔克斯,沃格迪尔克,沃伊尔尔特,舒尔克斯,齐格克,兹里奥茨",
      },
      {
        name: "巨人语",
        i: 38,
        min: 1,
        max: 10,
        d: "kdtng",
        m: 0,
        b: "阿杜恩德,埃罗拉,阿加内,阿努穆什,阿兰格里姆,巴胡尔格,巴拉格宗德,巴拉金布,巴拉克齐格,巴拉克津布,巴拉蒙兹,巴拉津布,贝奥内尔德,贝拉蒂拉,博格伯特,博萨里克,布雷姆罗尔,布雷尔斯汀,布里尔东,布罗祖,本杜顺德,伯萨格,查兹鲁克,切尔贡,丘尔特克,达格多尔,丹库克,达纳里克,德布赫,迪娜,迪内兹,迪鲁,德拉德,德鲁古克,杜格法斯特,杜哈尔,杜尔昆,埃尔顿德,埃努兹,埃拉达姆,埃拉德海姆,弗罗思索恩,芬温,加巴拉格兹,加巴拉姆,加比齐尔,加布赞,加格卡克,加尔法尔德,加尔格里姆,加塔尔,加津,盖鲁,吉拉,吉莱德齐尔,吉尔昆,格伦瓦特,格卢斯马克,戈姆鲁赫,戈尔克格,戈索,戈斯图兹,格里莫尔,格里姆蒂拉,古杜德,古德吉兹,古尔沃,古纳加思,贡杜萨布,古里尔,古尔卡莱,古鲁格,古齐,哈加思,哈特雷奥,海姆法拉,希尔德劳格,伊德古思,伊内兹,英吉尼,伊奥拉,伊尔金,贾尔多尔,贾尔瓦尔,约尔南加,约尔莫斯,卡 kek,卡尔托奇,凯格kez,肯戈德,卡尔布哈比尔恩,卡萨尔巴,卡齐兹丁,卡扎纳尔,卡齐拉格兹,卡兹达本,卡兹杜谢尔,昆达纳格,基巴拉克,基比扎尔,基吉内,基尔丰德,基尔坎,金巴达布,金布扎尔,科里尔,科斯坦德,库扎克,林迪拉,林加思,梅尔迪斯,马加尔,马博尔德,马布兰,梅姆龙,米努,米斯托奇,莫鲁奇,莫恩金,莫恩塔里奇,纳古,纳拉格扎,纳拉蒙兹,纳拉扎尔,纳加巴,纳加萨布,纳贡杜什,纳古努尔,纳坦,纳蒂尔,内利兹,内尔昆,诺鲁奇,诺金尼,努尔巴拉姆,努尔比尔纳格,努莱德扎,努莱德齐格,努卢克哈兹,努卢克赫尔,努尔克尔,奥奇,奥莱娜,奥尔斯汀,奥尔加,拉纳瓦,拉纳赫拉,兰内格,里尔坎,里曾,鲁尔基,鲁尔科克,萨德加奇,斯甘德罗尔,沙拉克扎尔,沙萨布比兹,沙齐兹杜什,沙托拉,希兹迪纳尔,绍卢克哈尔布,顺杜顺德,舒拉格宗德,西德加,西格比奥恩,西格比,索尔福德,索姆鲁德,斯罗克万,斯蒂格尔,苏尔杜赫,塔尔卡尔,西奥丹,西奥德里姆,思罗特莱克,提格基兹,托尔凯格,托伦,托扎格,图尔克格,图蒙扎尔,乌蒙扎德,温杜基尔,乌沙拉尔,瓦尔德海尔,瓦尔库德,韦尔菲斯,韦勒拉,维甘坎,沃尔基格,沃齐格,维尔韦德,威德希尔德,怀拉娅,伊利,约塔内,尤德戈尔,尤尔卡克,齐格兹,祖甘坎,祖克",
      },
      {
        name: "龙族语",
        i: 39,
        min: 1,
        min: 10,
        d: "aliuszrox",
        m: 0,
        b: "亚伦阿拉,阿达隆,阿达玛隆多,埃格利尔,埃罗斯克拉格帕拉尔,阿加兹斯坦,阿格拉埃罗斯,阿戈希尔沃,奥杜因,阿尔哈兹马巴德,阿尔塔戈斯,安马拉莎,阿姆伦纳塞德,阿纳格拉斯,安德拉塔纳奇,阿拉埃姆拉,阿拉乌萨托斯,阿拉萨托尔,阿尔哈泽尔,安加尔,阿尔维阿托雷斯,阿萨格拉斯,奥高拉斯,安蒂尔洛托,阿扎尔维兰德拉尔,阿扎克,巴拉戈斯,巴拉塔斯拉尔,布卢科伦达姆,布拉兹波利斯,坎斯拉克斯,卡普诺 lithyl,查尔克卡纳索尔,切尔刘易斯,切尔纳达蒂拉尔,西罗萨马拉,克劳吉利亚马塔,克拉格诺瑟马,达根图姆,登代尔默达马拉,德休布普克温皮尔,多姆博尔科吉,德拉科巴伦,德拉甘萨洛尔,杜普雷蒂斯卡瓦,杜尔内维尔,埃科阿瑟尔达兰杜斯,埃尔德里斯塞恩,埃尼克斯特里克斯,埃斯梅兰达娜,埃文埃洛拉索斯,法恩法伊尔,费尔戈洛斯,费尔里文瑟,菲尔克拉格,弗莱叶塞塔特,弗林纳斯蒂斯,加拉代罗斯,加尔格伦特,加内塔利斯,加萨姆斯,高兰蒂尔,高兰塔塔拉,格洛罗斯,格雷什鲁克,古扬诺萨,海尔因武雷姆,哈克拉莎拉,哈拉加斯特,哈拉格拉斯加,哈瓦兰,赫尔蒂派尔,赫斯赛普雷斯阿尔维尔,洪达拉,艾斯豪普坦纳桑尼克斯,伊尔伦德姆,伊尔萨拉,伊尔萨拉格,英吉洛卡斯特米兹利安,伊尔德里克瑞恩,伊什纳利尔,伊姆瑞斯,贾勒思凯特,贾兰瓦洛斯,贾拉坎,卡 sidikal,卡斯特兰德里利安,卡瓦拉诺斯,库拉洛斯桑塔,基松拉蒂萨尔,基塞特卡珊,基斯塔里安,克劳泽,克利萨伦德拉,克拉肖斯,克雷斯通,克里翁凡西库斯,克罗苏哈,克鲁斯塔诺斯,克鲁兹克雷尔,库尔德拉克,拉雷斯,拉托维诺默,拉马伦特索兹,利马克,马费尔诺塞克德哈纳尔,马埃莱斯特雷克斯,马加罗瓦兰坦兹,马哈特纳托里安,马尔利,马拉埃拉戈斯,马拉加斯豪尔,马拉赞,马尔德雷迪奥,马尔德里索尔,马莱克萨勒诺,毛里斯伊尔,梅贾斯,梅利奥迪安尼克斯,梅拉,米卡尔根西斯,米尔穆尼尔,米斯蒂纳珀拉达克莱斯,米蒂奇,米斯巴拉扎克,莫鲁埃姆,莫鲁哈泽尔,纳斯拉拉姆,纳哈格里夫,纳拉瓦劳萨托里尔,纳克索利塔尔斯,内瓦拉里奇,诺拉洛斯卡拉加斯辛特,努尔武雷姆,尼姆鲁,奥达维英,奥洛桑托,奥尔马拉戈斯,奥塔阿里亚卡诺斯,帕图纳克斯,佩拉斯,佩伦德拉阿尔,普拉埃洛里斯,普拉克萨斯兰多斯,普罗坦瑟,奇明斯蒂尔,奎林德里塔尔,拉利奥内特,拉撒利劳斯,拉斯古尔,劳格洛萨,劳莫萨达尔,雷洛尼基,林格雷默拉克斯,罗拉乌林,林纳尔维克斯,萨布拉克萨尔,萨洛克尼尔,萨罗塔尔,桑德拉利里昂,萨林达拉格洛索,萨瓦卡,沙拉马拉斯,沙马加尔,沙恩德雷尔,希安纳克斯,斯卡尔斯通,斯库奇,斯默加达,萨兰甘,萨苏里斯,萨瑟西拉斯,西尔瓦利瑟,塔马兰,坦特莱夫吉瑟斯,塔尔拉科尔,特纳拉克托尔,萨拉吉尔特,塔拉斯卡拉格拉姆,索格洛里莫戈鲁斯,索克拉斯特,塞卡,图尔维萨,乌尔文,乌因尼西瓦尔,乌尔纳利托加斯拉,维尔库西莫哈,维罗拉,文德拉达马拉,文诺明德哈,维因特鲁斯,沃拉格哈曼塔尔,沃斯拉拉姆,弗尔塔克,弗隆达霍雷沃斯,武尔乔特纳克,武尔瑟约尔,瓦斯蒂雷克,沃拉斯豪,沙吉索尔瓦,沙瓦拉西姆斯,耶梅尔,伊利萨尔加思,伊尔维拉萨利萨尔,扎吉库,扎兰德里,泽伦内斯特雷克斯,齐兰塔尔,佐尔马佩拉思,宗代拉泽利姆,兹佐拉",
      },
      {
        name: "蛛人语",
        i: 40,
        min: 1,
        max: 10,
        d: "erlsk",
        m: 0,
        b: "阿夸克瑟,艾西德,艾扎奇斯,阿林凯尔,阿斯塔,阿什拉什,卡阿托斯,奇克萨克斯,奇祖克,奇克希尔,岑奇,奇佐塞尔,奇泽德,查乔卡克,查里斯,查希利埃斯,切西布,切尔努尔,切齐,恰祖,奇什罗斯,奇希,奇芝,乔拉什,乔克沙,辛奇柴尔,科卢尔,埃库什泰德,埃基克,埃卡斯,厄乌瑞亚,埃里卡斯,埃斯塔斯,埃斯鲁布,埃克萨,哈克肖,希亚维希,希萨,霍克西,霍萨,伊 acid,伊西弗,伊鲁克,伊斯尼尔,基祖特,凯尔拉瓦斯,凯尔佐,基亚乔德,基卡,基尔祖尔,孔鲁德,克拉库,克拉克斯,克雷希什蒂,克里阿舒斯,克里卡,克里尔尼,克拉希尔,克莱尔沙,克利舒斯,克拉尼特,克拉斯泰克斯,克罗蒂卡斯,莱斯蒂德,莱祖,拉斯诺斯,伦克尔,莱坎切斯,莱扎德,利希尔,利维哈斯,洛赫图,利亚利塞德,利亚拉克,利塞瓦,利乔罗,利拉,洛基奇布,纳库尔,尼尔哈卡,尼特,尼佐,嫩奇尔德,内哈尔内斯,尼尔伊,尼祖斯,诺里克,昂奎克斯,卡利托,卡斯托尔,卡索尔,卡夫鲁德,卡武德,卡扎尔,卡兹鲁,克克诺,克克拉维,凯斯托,哈伊克萨尔,哈克希什,哈扎萨凯斯,赫尔利瓦,亨查克斯,赫拉扎尔,洪科斯,霍什,奇什图尔,奇西,科霍西,克兰奇克,拉西思,拉克泽斯,兰奇斯,拉希,拉兹,拉齐西亚,拉斯蒂,拉沃肖,雷卡德,雷基德,雷尼,雷塔基斯,雷佐凯斯,雷齐尔,拉西什,拉伊尔谢尔,拉伊尔希泽,拉基维克斯,拉凯尔,拉蒂克斯,雷西泽塞,雷维德,雷尔希尔,雷维希,利亚维科特,希科斯,希克斯,希基,希克拉卡尔,希斯内德,罗萨内特,里亚基斯内克斯,林塔查尔,里尔乌尔,鲁尔克,鲁扎克里,赛利克,桑奇克德,萨克舒,萨蒂尔,萨齐,塞卡斯,希耶斯,希克舍,希扎,施拉乔沃,施兰科,施拉沃斯,施拉武斯,施雷罗,施雷图,施里安提斯,施龙卡什,施罗瓦希尔,施罗齐,西亚卡乔,西佐什,西克沙,西罗,索诺西,斯拉库西,萨卡,萨西,萨卡阿瓦,萨苏,萨兹希洛斯,塞鲁德,塞扎德,塞克努尔,塞西尔,塞兹希罗斯,西尔斯,松科尔,索努克,希克,耶克苏,耶克佐克斯,耶希尔,耶克罗克,耶维德,伊卡维,伊雷什,伊西,伊西克泰,约哈克斯,扎奇克萨,扎克萨,泽尔拉克,泽科,扎伦乔,扎特阿奇什,扎维里特,扎兹拉奇,扎兹萨希尔,泽克萨,泽库,齐亚斯泰德,齐卡特,齐库尔,齐尔哈西尔,齐兹里,佐奇泽斯,齐亚里,齐尔尼布",
      },
      {
        name: "蛇人语",
        i: 41,
        min: 1,
        min: 10,
        d: "slrk",
        m: 0,
        b: "阿贾,阿吉,阿吉提斯,阿贾克斯,阿克萨斯,阿克西斯,阿尔恩,安杰什,阿普吉,阿尔克斯,阿萨兹,阿图斯,阿兹拉斯,卡吉,卡克拉萨尔,卡拉伦,卡普吉,卡斯拉斯,塞伊汉,塞斯,塞兹詹塔,西吉特,西纳什,西兹兰,科特朱斯,科斯拉什,库尔扎内克,库纳莱斯,埃杰泰什,埃尔扎扎什,埃尔盖克,埃什朱克,埃特里斯,甘贾斯,加普贾,加尔特希图普,戈普杰格斯,戈尔特什,格拉吉沙普,格拉特吉,格雷西纳斯,格罗泽什,格罗尔雅,格罗兹拉什,古吉卡,哈吉,赫杰赫兹,赫库什,霍尔加雷兹,伊卢普,伊普贾尔,伊塔希恩,卡杰斯,卡尔克什,凯普朱莎,基金图斯,基塞雷,科普,科普杰斯,克拉卡舍尔,克拉克,克拉普杰兹,克拉什朱莱斯,克拉兹吉,克里吉斯,克鲁辛,马卢什,马吉,马贾塔克,马拉,马普贾,马尔卡什,马尔基斯,马金,马斯,马坦,门贾斯,梅特贾雷什,米杰赫加克,明贾什,米特贾斯,莫纳斯,莫斯,纳贾哈斯,纳朱加什,纳克,纳普吉夫,纳尔卡,纳尔特胡斯,纳鲁沙,纳什,纳什杰克兹,纳塔普,尼贾斯,尼杰泰西普,尼什吉斯,诺尔库斯,努斯,奥卢鲁斯,奥提,奥瑟斯,帕贾,帕克卡,帕斯,帕图詹,帕兹贾兹,佩普杰拉斯,皮尔卡纳尔,皮图克,波尔朱内克,普克,拉根,兰杰斯,拉尔古什,拉兹朱普,里兹兰,里斯,里思鲁兹,罗吉斯,罗塞兹,拉贾阿塞什,拉贾塔斯,拉拉凯斯,拉拉图普,拉斯,拉兹雷什,拉杰希什,里格尔沙,罗克苏鲁什,鲁克鲁苏什,鲁里,鲁萨,鲁特杰斯,萨基泰什,萨尔萨斯,萨尔贾斯,萨兹朱祖什,塞尔泰兹,塞兹拉斯,沙贾斯,沙斯,沙什贾,谢泰什,希杰克,顺贾勒,舒尔雅里,斯卡勒,斯卡拉,斯卡伦塔斯,斯卡普,斯卡尔克里兹,斯卡瑟鲁克,斯克尔卡拉,斯科尔,斯科兹吉,斯库卢,斯库普,斯库尔特,斯拉利,斯拉特哈尔,斯莱兹里斯,斯利阿尔,斯洛兹吉萨,索杰什,索勒,索尔格,斯拉勒,斯兰吉,斯拉普杰斯,斯拉尔塔祖尔,斯拉什,斯拉特杰斯,斯拉特拉雷,斯尔克沙,斯鲁斯,斯鲁斯特古普,苏斯提尔,乌兹拉什,瓦尔古什,维克,维斯图,维普,武尔哈,武普杰尔,武什杰萨什,哈格兹,哈萨,舒尔泽苏,扎杰提斯,赞杰尔,扎里斯,扎塞格斯,齐雷斯,兹索尔,祖贾斯",
      },
      {
        name: "黎凡特阿拉伯语",
        i: 42,
        min: 1,
        min: 10,
        d: "ankprs",
        m: 0,
        b: "阿德梅,阿德梅特,阿加迪尔,阿卡,阿克齐布,阿利马斯,阿利斯-乌博,阿尔库什,阿米德,阿蒙,安皮,阿穆鲁,安达里格,安帕,阿拉登,阿拉姆,阿尔瓦德,阿什凯隆,阿塔尔,阿提克,阿扎,阿泽卡,巴勒贝克,巴比伦,巴特朗,贝罗特,贝尔谢巴,贝特谢梅什,贝鲁特,贝特阿古斯,贝特安雅,贝特霍伦,伯特利,伯利恒,彼土利,贝特纳林,贝特诺哈德拉,贝特扎林,比尔穆拉,比鲁塔,比特阿古希,比坦,比特扎马尼,塞尔内,大马士革,多尔,埃迪亚尔,伊甸埃克隆,埃拉,埃梅克,埃蒙,Ephratah,埃因加尼姆,菲尼克,加的斯,加拉太,加沙,朱拜勒,盖代拉,基利心山,客西马尼,基遍,基列,吉甲,各各他,歌珊,吉特,哈加利利,海法,阿勒颇,哈格尔德马,圣殿山,尼波山,皮斯加山,哈腓拉,哈措尔,希伯伦,何珥玛,伊博希姆,伊里霍,伊里内姆,伊里杜,以色列,卡叠什,迦南,卡帕拉,卡拉利,迦太基,凯雷特沙德谢特,克尔纳,凯塞德,凯撒利亚,卡夫尔,迦百农,哈利博恩,哈尔佩,哈马特,基里亚特,基提姆,库尔德,拉佩托斯,拉纳,莱普奇斯,莱普里普扎,利克索斯,罗德,卢夫,马拉卡,马莱特,马拉特,米吉多,梅利塔,马尔丁,梅察达,米什马罗特,米茨拉伊姆,摩押,莫普索斯,莫泰,穆基什,南皮吉,南皮古,拿撒勒,尼姆鲁德,尼尼微,诺布,努哈德拉,欧埃,俄斐,奥亚特,菲内卡,腓尼基,普莱斯海特,卡尔图巴萨雷塔,卡特纳,拉巴特阿蒙,拉卡塔,拉马特阿乌,拉米塔,拉姆塔,雷霍沃特,雷谢夫,鲁沙迪尔,鲁沙卡德,萨姆林,塞法拉德,塞洪,塞帕特,塞克西,沙龙,示剑,谢费拉特,什法尼姆,示罗,施玛雅,撒马利亚,西顿,西奈,西斯,索尔基,苏尔,叙利亚,塔贝图,泰德穆尔,他施,塔尔图斯,太巴列,特费塞德特,提哥亚,提曼,廷加,提帕萨,察布拉坦,图尔阿卜丁,萨法特,锡安,措尔,乌加里特,乌努巴尔,乌鲁什勒姆,乌鲁海,耶路撒冷,瓦加,雅法,亚姆哈德,基尼烈,亚穆特巴尔,叶斯里卜,雅乌迪,亚弗尼,犹大,耶夫,耶布斯,伊茨雷埃尔,约尔丹,扎雷法特,西波依姆,泽尔塔,泽伊蒂姆,齐克隆,兹穆尔纳",
      },
    ];
  };

  return {
    getBase,
    getCulture,
    getCultureShort,
    getBaseShort,
    getState,
    updateChain,
    clearChains,
    getNameBases,
    getMapName,
    calculateChain,
  };
})();
